/**
 * Created by chun on 2016/9/22.
 */

//医院等级
var dataTimeType = [
    {"code": "0", "name": "月"},
    {"code": "1", "name": "年"}
];
var dataAnalyType = [
    {"code": "0", "name": "医疗专科"},
    {"code": "1", "name": "MDC分类"}
];
//医院等级
var dataHospitalDegree = [
    {"code": "0101", "name": "三甲医院"},
    {"code": "0102", "name": "三乙医院"},
    {"code": "0201", "name": "二甲医院"},
    {"code": "0202", "name": "二乙医院"},
    {"code": "0301", "name": "二乙以下下浮10%"},
    {"code": "0302", "name": "二乙以下下浮20%"}
];
//指标类型
var dataIndexType = [
    {
        "code": "0", "name": "综合能力类",
        "children": [
            {"code": "0", "name": "病例数"},
            {"code": "1", "name": "病例数2"},
            {"code": "2", "name": "病例数3"},
            {"code": "3", "name": "病例数4"}
        ]
    },
    {
        "code": "1", "name": "医疗质量类",
        "children": [
            {"code": "0", "name": "医疗质量"},
            {"code": "1", "name": "医疗质量1"},
            {"code": "2", "name": "医疗质量2"},
            {"code": "3", "name": "医疗质量3"}
        ]
    },
    {
        "code": "2", "name": "医疗费用类",
        "children": [
            {"code": "0", "name": "病例数"},
            {"code": "1", "name": "病例数2"},
            {"code": "2", "name": "病例数3"},
            {"code": "3", "name": "病例数4"}
        ]
    },
    {
        "code": "3", "name": "医疗难度类",
        "children": [
            {"code": "0", "name": "医疗难度"},
            {"code": "1", "name": "医疗难度1"},
            {"code": "2", "name": "医疗难度2"},
            {"code": "3", "name": "医疗难度3"}
        ]
    },
    {
        "code": "4", "name": "病案质量类",
        "children": [
            {"code": "0", "name": "病例数"},
            {"code": "1", "name": "病案质量1"},
            {"code": "2", "name": "病案质量2"},
            {"code": "3", "name": "病案质量3"}
        ]
    }
];
var dataMdcDrgs = [ {
    "children" : [ {
        "code" : "001",
        "name" : "心脏移植或心脏辅助系统植入（MCC）"
    }, {
        "code" : "002",
        "name" : "心脏移植或心脏辅助系统植入（-）"
    }, {
        "code" : "003",
        "name" : "气管切开伴呼吸机支持≥96小时、或伴PDX为面部口部颈部以外的大型手术室操作，或ECMO"
    }, {
        "code" : "004",
        "name" : "气管切开伴呼吸机支持≥96小时、或PDX为面部口部颈部以外的非大型手术室操作"
    }, {
        "code" : "005",
        "name" : "肝移植（MCC）或肠移植"
    }, {
        "code" : "006",
        "name" : "肝移植（-）"
    }, {
        "code" : "007",
        "name" : "肺移植"
    }, {
        "code" : "008",
        "name" : "胰和肾同时移植"
    }, {
        "code" : "010",
        "name" : "胰腺移植"
    }, {
        "code" : "011",
        "name" : "脸，嘴和颈部诊断的气管切开术（MCC）"
    }, {
        "code" : "012",
        "name" : "脸，嘴和颈部诊断的气管切开术（CC）"
    }, {
        "code" : "013",
        "name" : "脸，嘴和颈部诊断的气管切开术（-）"
    }, {
        "code" : "014",
        "name" : "异体骨髓／造血干细胞移植　　"
    }, {
        "code" : "016",
        "name" : "自体骨髓／造血干细胞移植（CC/MCC）"
    }, {
        "code" : "017",
        "name" : "自体骨髓／造血干细胞移植（-）"
    } ],
    "code" : "0",
    "name" : "各种移植术和气管切开"
}, {
    "children" : [ {
        "code" : "020",
        "name" : "PDX为颅内出血的颅内血管手术（MCC）"
    }, {
        "code" : "021",
        "name" : "PDX为颅内出血的颅内血管手术（CC）"
    }, {
        "code" : "022",
        "name" : "PDX为颅内出血的颅内血管手术（-）"
    }, {
        "code" : "023",
        "name" : "重要装置植入的开颅手术，或中枢神经系统的急性复杂PDX（MCC或化疗剂植入）"
    }, {
        "code" : "024",
        "name" : "重要装置植入的开颅手术，或中枢神经系统的急性复杂PDX（-）"
    }, {
        "code" : "025",
        "name" : "开颅手术和血管内颅内手术（MCC）"
    }, {
        "code" : "026",
        "name" : "开颅手术与血管内颅内手术（CC）"
    }, {
        "code" : "027",
        "name" : "开颅手术和血管内颅内手术（-）"
    }, {
        "code" : "028",
        "name" : "脊髓手术（MCC）"
    }, {
        "code" : "029",
        "name" : "脊髓手术（CC）"
    }, {
        "code" : "030",
        "name" : "脊髓手术（-）"
    }, {
        "code" : "031",
        "name" : "脑室分流及翻修手术（MCC）"
    }, {
        "code" : "032",
        "name" : "脑室分流及翻修手术（CC）"
    }, {
        "code" : "033",
        "name" : "脑室分流及翻修手术（-）"
    }, {
        "code" : "034",
        "name" : "颈动脉支架手术（MCC）"
    }, {
        "code" : "035",
        "name" : "颈动脉支架手术（CC）"
    }, {
        "code" : "036",
        "name" : "颈动脉支架手术（-）"
    }, {
        "code" : "037",
        "name" : "颅外手术（MCC）"
    }, {
        "code" : "038",
        "name" : "颅外手术（CC）"
    }, {
        "code" : "039",
        "name" : "颅外手术（-）"
    }, {
        "code" : "040",
        "name" : "周围、颅神经及其他神经系统手术（MCC）"
    }, {
        "code" : "041",
        "name" : "周围、颅神经及其他神经系统手术（CC）"
    }, {
        "code" : "042",
        "name" : "周围、颅神经及其他神经系统手术（-）"
    }, {
        "code" : "052",
        "name" : "脊髓损伤及功能障碍（MCC/CC）"
    }, {
        "code" : "053",
        "name" : "脊髓损伤及功能障碍（-）"
    }, {
        "code" : "054",
        "name" : "神经系统肿瘤（MCC）"
    }, {
        "code" : "055",
        "name" : "神经系统肿瘤（-）"
    }, {
        "code" : "056",
        "name" : "退行性神经系统疾病（MCC）"
    }, {
        "code" : "057",
        "name" : "退行性神经系统疾病（-）"
    }, {
        "code" : "058",
        "name" : "多发性硬化和小脑共济失调（MCC）"
    }, {
        "code" : "059",
        "name" : "多发性硬化和小脑共济失调（CC）"
    }, {
        "code" : "060",
        "name" : "多发性硬化和小脑共济失调（-）"
    }, {
        "code" : "061",
        "name" : "溶栓剂治疗下的急性缺血性脑卒中（MCC）"
    }, {
        "code" : "062",
        "name" : "溶栓剂治疗下的急性缺血性脑卒中（CC）"
    }, {
        "code" : "063",
        "name" : "溶栓剂治疗下的急性缺血性脑卒中（-）"
    }, {
        "code" : "064",
        "name" : "颅内出血或脑梗塞（MCC）"
    }, {
        "code" : "065",
        "name" : "颅内出血或脑梗塞（CC或24小时内使用TPA溶栓）"
    }, {
        "code" : "066",
        "name" : "颅内出血或脑梗塞（-）"
    }, {
        "code" : "067",
        "name" : "未特指的脑血管意外或闭塞（无梗死）（MCC）"
    }, {
        "code" : "068",
        "name" : "未特指的脑血管意外或闭塞（无梗死）（-）"
    }, {
        "code" : "069",
        "name" : "暂时性脑缺血"
    }, {
        "code" : "070",
        "name" : "非特指的脑血管疾病（MCC）"
    }, {
        "code" : "071",
        "name" : "非特指的脑血管疾病（CC）"
    }, {
        "code" : "072",
        "name" : "非特指的脑血管疾病（-）"
    }, {
        "code" : "073",
        "name" : "脑和外周神经紊乱（MCC）"
    }, {
        "code" : "074",
        "name" : "脑和外周神经紊乱（-）"
    }, {
        "code" : "075",
        "name" : "病毒性脑膜炎（CC/MCC）"
    }, {
        "code" : "076",
        "name" : "病毒性脑膜炎（-）"
    }, {
        "code" : "077",
        "name" : "高血压脑病（MCC）"
    }, {
        "code" : "078",
        "name" : "高血压脑病（CC）"
    }, {
        "code" : "079",
        "name" : "高血压脑病（-）"
    }, {
        "code" : "080",
        "name" : "非创伤性木僵及昏迷（MCC）"
    }, {
        "code" : "081",
        "name" : "非创伤性木僵及昏迷（-）"
    }, {
        "code" : "082",
        "name" : "创伤性木僵及昏迷，持续1小时以上（MCC）"
    }, {
        "code" : "083",
        "name" : "创伤性木僵及昏迷，持续1小时以上（CC）"
    }, {
        "code" : "084",
        "name" : "创伤性木僵及昏迷，持续1小时以上（-）"
    }, {
        "code" : "085",
        "name" : "创伤性木僵及昏迷，持续不足1小时（MCC）"
    }, {
        "code" : "086",
        "name" : "创伤性木僵及昏迷，持续不足1小时（CC）"
    }, {
        "code" : "087",
        "name" : "创伤性木僵及昏迷，持续不足1小时（-）"
    }, {
        "code" : "088",
        "name" : "脑震荡（MCC）"
    }, {
        "code" : "089",
        "name" : "脑震荡（CC）"
    }, {
        "code" : "090",
        "name" : "脑震荡（-）"
    }, {
        "code" : "091",
        "name" : "其他神经系统紊乱（MCC）"
    }, {
        "code" : "092",
        "name" : "其他神经系统紊乱（CC）"
    }, {
        "code" : "093",
        "name" : "其他神经系统紊乱（-）"
    }, {
        "code" : "094",
        "name" : "细菌性和结核性神经系统感染（MCC）"
    }, {
        "code" : "095",
        "name" : "细菌性和结核性神经系统感染（CC）"
    }, {
        "code" : "096",
        "name" : "细菌性和结核性神经系统感染（-）"
    }, {
        "code" : "097",
        "name" : "除病毒性脑膜炎外的非细菌性神经系统感染（MCC）"
    }, {
        "code" : "098",
        "name" : "除病毒性脑膜炎外的非细菌性神经系统感染（CC）"
    }, {
        "code" : "099",
        "name" : "除病毒性脑膜炎外的非细菌性神经系统感染（-）"
    }, {
        "code" : "100",
        "name" : "癫痫发作（MCC）"
    }, {
        "code" : "101",
        "name" : "癫痫发作（-）"
    }, {
        "code" : "102",
        "name" : "头痛（MCC）"
    }, {
        "code" : "103",
        "name" : "头痛（-）"
    } ],
    "code" : "1",
    "name" : "神经系统疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "113",
        "name" : "眼窝手术（CC/MCC）"
    }, {
        "code" : "114",
        "name" : "眼窝手术（-）"
    }, {
        "code" : "115",
        "name" : "除眼窝外的外眼手术"
    }, {
        "code" : "116",
        "name" : "内眼手术（CC/MCC）"
    }, {
        "code" : "117",
        "name" : "内眼手术（-）"
    }, {
        "code" : "121",
        "name" : "眼部急性重大感染（CC/MCC）"
    }, {
        "code" : "122",
        "name" : "眼部急性重大感染（-）"
    }, {
        "code" : "123",
        "name" : "眼科神经疾病"
    }, {
        "code" : "124",
        "name" : "其他眼疾患（MCC）"
    }, {
        "code" : "125",
        "name" : "其他眼疾患（-）"
    } ],
    "code" : "2",
    "name" : "眼疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "129",
        "name" : "重大头颈部手术（CC/MCC或重要装置置入）"
    }, {
        "code" : "130",
        "name" : "重大头颈部手术（-）"
    }, {
        "code" : "131",
        "name" : "颅、面部手术（CC/MCC)"
    }, {
        "code" : "132",
        "name" : "颅、面部手术（-)"
    }, {
        "code" : "133",
        "name" : "其他耳鼻口喉部的手术（CC/MCC）"
    }, {
        "code" : "134",
        "name" : "其他耳鼻口喉部的手术（-）"
    }, {
        "code" : "135",
        "name" : "窦及乳突手术（CC/MCC）"
    }, {
        "code" : "136",
        "name" : "窦及乳突手术（-）"
    }, {
        "code" : "137",
        "name" : "嘴部手术（CC/MCC）"
    }, {
        "code" : "138",
        "name" : "嘴部手术（-）"
    }, {
        "code" : "139",
        "name" : "腮腺及其他唾液腺手术"
    }, {
        "code" : "146",
        "name" : "耳鼻口喉部的恶性肿瘤（MCC）"
    }, {
        "code" : "147",
        "name" : "耳鼻口喉部的恶性肿瘤（CC）"
    }, {
        "code" : "148",
        "name" : "耳鼻口喉部的恶性肿瘤（-）"
    }, {
        "code" : "149",
        "name" : "平衡失调"
    }, {
        "code" : "150",
        "name" : "鼻出血（MCC）"
    }, {
        "code" : "151",
        "name" : "鼻出血（-）"
    }, {
        "code" : "152",
        "name" : "中耳炎及上呼吸道感染（MCC）"
    }, {
        "code" : "153",
        "name" : "中耳炎及上呼吸道感染（-）"
    }, {
        "code" : "154",
        "name" : "其他耳朵，鼻子，嘴和喉咙的诊断（MCC）"
    }, {
        "code" : "155",
        "name" : "其他耳朵，鼻子，嘴和喉咙的诊断（CC）"
    }, {
        "code" : "156",
        "name" : "其他耳朵，鼻子，嘴和喉咙的诊断（-）"
    }, {
        "code" : "157",
        "name" : "牙科和口腔疾病（MCC）"
    }, {
        "code" : "158",
        "name" : "牙科和口腔疾病（CC）"
    }, {
        "code" : "159",
        "name" : "牙科和口腔疾病（-）"
    } ],
    "code" : "3",
    "name" : "耳鼻口喉疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "163",
        "name" : "胸部大手术（MCC）"
    }, {
        "code" : "164",
        "name" : "胸部大手术（CC）"
    }, {
        "code" : "165",
        "name" : "胸部大手术（-）"
    }, {
        "code" : "166",
        "name" : "其他的呼吸系统手术（MCC）"
    }, {
        "code" : "167",
        "name" : "其他的呼吸系统手术（CC）"
    }, {
        "code" : "168",
        "name" : "其他的呼吸系统手术（-）"
    }, {
        "code" : "175",
        "name" : "肺栓塞（MCC）"
    }, {
        "code" : "176",
        "name" : "肺栓塞（-）"
    }, {
        "code" : "177",
        "name" : "呼吸道感染和炎症（MCC）"
    }, {
        "code" : "178",
        "name" : "呼吸道感染和炎症（CC）"
    }, {
        "code" : "179",
        "name" : "呼吸道感染和炎症（-）"
    }, {
        "code" : "180",
        "name" : "呼吸道肿瘤（MCC）"
    }, {
        "code" : "181",
        "name" : "呼吸道肿瘤（CC）"
    }, {
        "code" : "182",
        "name" : "呼吸道肿瘤（-）"
    }, {
        "code" : "183",
        "name" : "胸部重大创伤（MCC）"
    }, {
        "code" : "184",
        "name" : "胸部重大创伤（CC）"
    }, {
        "code" : "185",
        "name" : "胸部重大创伤（-）"
    }, {
        "code" : "186",
        "name" : "胸腔积液（MCC）"
    }, {
        "code" : "187",
        "name" : "胸腔积液（CC）"
    }, {
        "code" : "188",
        "name" : "胸腔积液（-）"
    }, {
        "code" : "189",
        "name" : "肺水肿与呼吸衰竭"
    }, {
        "code" : "190",
        "name" : "慢性阻塞性肺病（MCC）"
    }, {
        "code" : "191",
        "name" : "慢性阻塞性肺病（CC）"
    }, {
        "code" : "192",
        "name" : "慢性阻塞性肺病（-）"
    }, {
        "code" : "193",
        "name" : "单纯肺炎和胸膜炎（MCC）"
    }, {
        "code" : "194",
        "name" : "单纯肺炎和胸膜炎（CC）"
    }, {
        "code" : "195",
        "name" : "单纯肺炎和胸膜炎（-）"
    }, {
        "code" : "196",
        "name" : "间质性肺病（MCC）"
    }, {
        "code" : "197",
        "name" : "间质性肺病（CC）"
    }, {
        "code" : "198",
        "name" : "间质性肺病（-）"
    }, {
        "code" : "199",
        "name" : "气胸（MCC）"
    }, {
        "code" : "200",
        "name" : "气胸（CC）"
    }, {
        "code" : "201",
        "name" : "气胸（-）"
    }, {
        "code" : "202",
        "name" : "支气管炎、哮喘（CC/MCC）"
    }, {
        "code" : "203",
        "name" : "支气管炎、哮喘（-）"
    }, {
        "code" : "204",
        "name" : "呼吸系统的症状、体征"
    }, {
        "code" : "205",
        "name" : "其他呼吸系统诊断（MCC）"
    }, {
        "code" : "206",
        "name" : "其他呼吸系统诊断（-）"
    }, {
        "code" : "207",
        "name" : "呼吸系统诊断伴96小时以上呼吸机支持"
    }, {
        "code" : "208",
        "name" : "呼吸系统诊断伴96小时以下呼吸机支持"
    } ],
    "code" : "4",
    "name" : "呼吸系统疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "215",
        "name" : "其他心脏辅助系统植入"
    }, {
        "code" : "216",
        "name" : "伴心脏导管的心脏瓣膜手术及重大胸腔操作（MCC）"
    }, {
        "code" : "217",
        "name" : "伴心脏导管的心脏瓣膜手术及重大胸腔操作（CC）"
    }, {
        "code" : "218",
        "name" : "伴心脏导管的心脏瓣膜手术及重大胸腔操作（-）"
    }, {
        "code" : "219",
        "name" : "无心脏导管的心脏瓣膜手术及重大胸腔操作（MCC）"
    }, {
        "code" : "220",
        "name" : "无心脏导管的心脏瓣膜手术及重大胸腔操作（CC）"
    }, {
        "code" : "221",
        "name" : "无心脏导管的心脏瓣膜手术及重大胸腔操作（-）"
    }, {
        "code" : "222",
        "name" : "急性心肌梗死/心脏衰竭/休克下的伴心脏导管的心脏除颤器植入（MCC）"
    }, {
        "code" : "223",
        "name" : "急性心肌梗死/心脏衰竭/休克下的伴心脏导管的心脏除颤器植入（-）"
    }, {
        "code" : "224",
        "name" : "无急性心肌梗死/心脏衰竭/休克发生的伴心脏导管的心脏除颤器植入（MCC）"
    }, {
        "code" : "225",
        "name" : "无急性心肌梗死/心脏衰竭/休克发生的伴心脏导管的心脏除颤器植入（-）"
    }, {
        "code" : "226",
        "name" : "无心脏导管操作的心脏除颤器植入（MCC）"
    }, {
        "code" : "227",
        "name" : "无心脏导管操作的心脏除颤器植入（-）"
    }, {
        "code" : "228",
        "name" : "其他心胸操作（MCC）"
    }, {
        "code" : "229",
        "name" : "其他心胸操作（CC）"
    }, {
        "code" : "230",
        "name" : "其他心胸操作（-）"
    }, {
        "code" : "231",
        "name" : "冠状动脉搭桥伴PTCA（MCC）"
    }, {
        "code" : "232",
        "name" : "冠状动脉搭桥伴PTCA（-）"
    }, {
        "code" : "233",
        "name" : "冠状动脉搭桥，伴心导管操作（MCC）"
    }, {
        "code" : "234",
        "name" : "冠状动脉搭桥，伴心导管操作（-）"
    }, {
        "code" : "235",
        "name" : "无心脏导管操作的冠状动脉搭桥（MCC）"
    }, {
        "code" : "236",
        "name" : "无心脏导管操作的冠状动脉搭桥（-）"
    }, {
        "code" : "237",
        "name" : "重大心血管手术（MCC）"
    }, {
        "code" : "238",
        "name" : "重大心血管手术（-）"
    }, {
        "code" : "239",
        "name" : "循环系统障碍导致的截肢，上肢和脚趾除外（MCC）"
    }, {
        "code" : "240",
        "name" : "循环系统障碍导致的截肢，上肢和脚趾除外（CC）"
    }, {
        "code" : "241",
        "name" : "循环系统障碍导致的截肢，上肢和脚趾除外（-）"
    }, {
        "code" : "242",
        "name" : "永久性心脏起搏器植入（MCC）"
    }, {
        "code" : "243",
        "name" : "永久性心脏起搏器植入（CC）"
    }, {
        "code" : "244",
        "name" : "永久性心脏起搏器植入（-）"
    }, {
        "code" : "245",
        "name" : "可植入式自动复律除颤器启动操作"
    }, {
        "code" : "246",
        "name" : "经皮的心血管操作及药物洗脱支架植入操作（MCC/4条血管以上/多个支架）"
    }, {
        "code" : "247",
        "name" : "经皮的心血管操作及药物洗脱支架植入操作（-）"
    }, {
        "code" : "248",
        "name" : "经皮的心血管操作及非药物洗脱支架植入操作（MCC/4条血管以上/多个支架）"
    }, {
        "code" : "249",
        "name" : "经皮的心血管操作及非药物洗脱支架植入操作（-）"
    }, {
        "code" : "250",
        "name" : "经皮的心血管操作，无冠状动脉支架植入（MCC）"
    }, {
        "code" : "251",
        "name" : "经皮的心血管操作，无冠状动脉支架植入（-）"
    }, {
        "code" : "252",
        "name" : "其他血管操作（MCC）"
    }, {
        "code" : "253",
        "name" : "其他血管操作（CC）"
    }, {
        "code" : "254",
        "name" : "其他血管操作（-）"
    }, {
        "code" : "255",
        "name" : "循环系统障碍导致的上肢和脚趾截肢（MCC）"
    }, {
        "code" : "256",
        "name" : "循环系统障碍导致的上肢和脚趾截肢（CC）"
    }, {
        "code" : "257",
        "name" : "循环系统障碍导致的上肢和脚趾截肢（-）"
    }, {
        "code" : "258",
        "name" : "心脏起搏器装置置换（MCC）"
    }, {
        "code" : "259",
        "name" : "心脏起搏器装置置换（-）"
    }, {
        "code" : "260",
        "name" : "除装置置换外的心脏起搏器矫正（MCC）"
    }, {
        "code" : "261",
        "name" : "除装置置换外的心脏起搏器矫正（CC）"
    }, {
        "code" : "262",
        "name" : "除装置置换外的心脏起搏器矫正（-）"
    }, {
        "code" : "263",
        "name" : "静脉结扎剥脱术"
    }, {
        "code" : "264",
        "name" : "其他的循环系统手术"
    }, {
        "code" : "265",
        "name" : "可植入式自动复律除颤器引入操作"
    }, {
        "code" : "266",
        "name" : "心脏瓣膜置换手术（MCC）"
    }, {
        "code" : "267",
        "name" : "心脏瓣膜置换手术（-）"
    }, {
        "code" : "280",
        "name" : "急性心肌梗死，存活出院（MCC）"
    }, {
        "code" : "281",
        "name" : "急性心肌梗死，存活出院（CC）"
    }, {
        "code" : "282",
        "name" : "急性心肌梗死，存活出院（-）"
    }, {
        "code" : "283",
        "name" : "急性心肌梗死，死亡出院（MCC）"
    }, {
        "code" : "284",
        "name" : "急性心肌梗死，死亡出院（CC）"
    }, {
        "code" : "285",
        "name" : "急性心肌梗死，死亡出院（-）"
    }, {
        "code" : "286",
        "name" : "急性心肌梗死外的循环系统障碍，伴心导管操作（MCC）"
    }, {
        "code" : "287",
        "name" : "急性心肌梗死外的循环系统障碍，伴心导管操作（-）"
    }, {
        "code" : "288",
        "name" : "急性和亚急性心内膜炎（MCC）"
    }, {
        "code" : "289",
        "name" : "急性和亚急性心内膜炎（CC）"
    }, {
        "code" : "290",
        "name" : "急性和亚急性心内膜炎（-）"
    }, {
        "code" : "291",
        "name" : "心脏衰竭与休克（MCC）"
    }, {
        "code" : "292",
        "name" : "心脏衰竭与休克（CC）"
    }, {
        "code" : "293",
        "name" : "心脏衰竭和休克（-）"
    }, {
        "code" : "294",
        "name" : "深静脉血栓性静脉炎（CC/MCC）"
    }, {
        "code" : "295",
        "name" : "深静脉血栓性静脉炎（-）"
    }, {
        "code" : "296",
        "name" : "原因不明的心脏骤停（MCC）"
    }, {
        "code" : "297",
        "name" : "原因不明的心脏骤停（CC）"
    }, {
        "code" : "298",
        "name" : "原因不明的心脏骤停（-）"
    }, {
        "code" : "299",
        "name" : "外周血管功能障碍（MCC）"
    }, {
        "code" : "300",
        "name" : "外周血管功能障碍（CC）"
    }, {
        "code" : "301",
        "name" : "外周血管功能障碍（-）"
    }, {
        "code" : "302",
        "name" : "动脉粥样硬化（MCC）"
    }, {
        "code" : "303",
        "name" : "动脉粥样硬化（-）"
    }, {
        "code" : "304",
        "name" : "高血压（MCC）"
    }, {
        "code" : "305",
        "name" : "高血压（-）"
    }, {
        "code" : "306",
        "name" : "先天性心脏及瓣膜疾病（MCC）"
    }, {
        "code" : "307",
        "name" : "先天性心脏及瓣膜疾病（-）"
    }, {
        "code" : "308",
        "name" : "心律失常及传导障碍（MCC）"
    }, {
        "code" : "309",
        "name" : "心律失常及传导障碍（CC）"
    }, {
        "code" : "310",
        "name" : "心律失常及传导障碍（-）"
    }, {
        "code" : "311",
        "name" : "心绞痛"
    }, {
        "code" : "312",
        "name" : "晕厥与虚脱"
    }, {
        "code" : "313",
        "name" : "胸痛"
    }, {
        "code" : "314",
        "name" : "其他循环系统诊断（MCC）"
    }, {
        "code" : "315",
        "name" : "其他循环系统诊断（CC）"
    }, {
        "code" : "316",
        "name" : "其他循环系统诊断（-）"
    } ],
    "code" : "5",
    "name" : "循环系统疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "326",
        "name" : "食管、胃、十二指肠手术（MCC）"
    }, {
        "code" : "327",
        "name" : "食管、胃、十二指肠手术（CC）"
    }, {
        "code" : "328",
        "name" : "食管、胃、十二指肠手术（-）"
    }, {
        "code" : "329",
        "name" : "小肠、大肠的大手术（MCC）"
    }, {
        "code" : "330",
        "name" : "小肠、大肠的大手术（CC）"
    }, {
        "code" : "331",
        "name" : "小肠、大肠的大手术（-）"
    }, {
        "code" : "332",
        "name" : "直肠切除手术（MCC）"
    }, {
        "code" : "333",
        "name" : "直肠切除手术（CC）"
    }, {
        "code" : "334",
        "name" : "直肠切除手术（-）"
    }, {
        "code" : "335",
        "name" : "腹腔/盆腔内粘连松解术（MCC）"
    }, {
        "code" : "336",
        "name" : "腹腔/盆腔内粘连松解术（CC）"
    }, {
        "code" : "337",
        "name" : "腹腔/盆腔内粘连松解术（-）"
    }, {
        "code" : "338",
        "name" : "合并复杂主诊断的阑尾切除术（MCC）"
    }, {
        "code" : "339",
        "name" : "合并复杂主诊断的阑尾切除术（CC）"
    }, {
        "code" : "340",
        "name" : "合并复杂主诊断的阑尾切除术（-）"
    }, {
        "code" : "341",
        "name" : "无复杂主诊断的阑尾切除术（MCC）"
    }, {
        "code" : "342",
        "name" : "无复杂主诊断的阑尾切除术（CC）"
    }, {
        "code" : "343",
        "name" : "无复杂主诊断的阑尾切除术（-）"
    }, {
        "code" : "344",
        "name" : "小肠、大肠的小手术（MCC）"
    }, {
        "code" : "345",
        "name" : "小肠、大肠的小手术（CC）"
    }, {
        "code" : "346",
        "name" : "小肠、大肠的小手术（-）"
    }, {
        "code" : "347",
        "name" : "肛门及消化道造口手术（MCC）"
    }, {
        "code" : "348",
        "name" : "肛门及消化道造口手术（CC）"
    }, {
        "code" : "349",
        "name" : "肛门及消化道造口手术（-）"
    }, {
        "code" : "350",
        "name" : "腹股沟及腹疝手术（MCC）"
    }, {
        "code" : "351",
        "name" : "腹股沟及腹疝手术（CC）"
    }, {
        "code" : "352",
        "name" : "腹股沟及腹疝手术（-）"
    }, {
        "code" : "353",
        "name" : "其他疝手术，除腹股沟及腹疝（MCC）"
    }, {
        "code" : "354",
        "name" : "其他疝手术，除腹股沟及腹疝（CC）"
    }, {
        "code" : "355",
        "name" : "其他疝手术，除腹股沟及腹疝（-）"
    }, {
        "code" : "356",
        "name" : "其他消化系统手术（MCC）"
    }, {
        "code" : "357",
        "name" : "其他消化系统手术（CC）"
    }, {
        "code" : "358",
        "name" : "其他消化系统手术（-）"
    }, {
        "code" : "368",
        "name" : "重大食道功能障碍（MCC）"
    }, {
        "code" : "369",
        "name" : "重大食道功能障碍（CC）"
    }, {
        "code" : "370",
        "name" : "重大食道功能障碍（-）"
    }, {
        "code" : "371",
        "name" : "重大胃肠疾病及腹腔感染（MCC）"
    }, {
        "code" : "372",
        "name" : "重大胃肠疾病及腹腔感染（CC）"
    }, {
        "code" : "373",
        "name" : "重大胃肠疾病及腹腔感染（-）"
    }, {
        "code" : "374",
        "name" : "消化系统恶性肿瘤（MCC）"
    }, {
        "code" : "375",
        "name" : "消化系统恶性肿瘤（CC）"
    }, {
        "code" : "376",
        "name" : "消化系统恶性肿瘤（-）"
    }, {
        "code" : "377",
        "name" : "胃肠出血（MCC）"
    }, {
        "code" : "378",
        "name" : "胃肠出血（CC）"
    }, {
        "code" : "379",
        "name" : "胃肠出血（-）"
    }, {
        "code" : "380",
        "name" : "重度消化性溃疡（MCC）"
    }, {
        "code" : "381",
        "name" : "重度消化性溃疡（CC）"
    }, {
        "code" : "382",
        "name" : "重度消化性溃疡（-）"
    }, {
        "code" : "383",
        "name" : "轻度消化性溃疡（MCC）"
    }, {
        "code" : "384",
        "name" : "轻度消化性溃疡（-）"
    }, {
        "code" : "385",
        "name" : "肠炎（MCC）"
    }, {
        "code" : "386",
        "name" : "肠炎（CC）"
    }, {
        "code" : "387",
        "name" : "肠炎（-）"
    }, {
        "code" : "388",
        "name" : "消化道梗阻（MCC）"
    }, {
        "code" : "389",
        "name" : "消化道梗阻（CC）"
    }, {
        "code" : "390",
        "name" : "消化道梗阻（-）"
    }, {
        "code" : "391",
        "name" : "食管炎、胃肠炎及其他炎症（MCC）"
    }, {
        "code" : "392",
        "name" : "食管炎、胃肠炎及其他炎症（-）"
    }, {
        "code" : "393",
        "name" : "其他消化系统诊断（MCC）"
    }, {
        "code" : "394",
        "name" : "其他消化系统诊断（CC）"
    }, {
        "code" : "395",
        "name" : "其他消化系统诊断（-）"
    } ],
    "code" : "6",
    "name" : "消化系统疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "405",
        "name" : "胰、肝及其吻合性手术（MCC）"
    }, {
        "code" : "406",
        "name" : "胰、肝及其吻合性手术（CC）"
    }, {
        "code" : "407",
        "name" : "胰、肝及其吻合性手术（-）"
    }, {
        "code" : "408",
        "name" : "胆囊切除术外的胆道手术（MCC）"
    }, {
        "code" : "409",
        "name" : "胆囊切除术外的胆道手术（CC）"
    }, {
        "code" : "410",
        "name" : "胆囊切除术外的胆道手术（-）"
    }, {
        "code" : "411",
        "name" : "胆囊切除术伴总胆管探查（MCC）"
    }, {
        "code" : "412",
        "name" : "胆囊切除术伴总胆管探查（CC）"
    }, {
        "code" : "413",
        "name" : "胆囊切除术伴总胆管探查（-）"
    }, {
        "code" : "414",
        "name" : "无腹腔镜的胆囊切除术，无胆总管探查（MCC）"
    }, {
        "code" : "415",
        "name" : "无腹腔镜的胆囊切除术，无胆总管探查（CC）"
    }, {
        "code" : "416",
        "name" : "无腹腔镜的胆囊切除术，无胆总管探查（-）"
    }, {
        "code" : "417",
        "name" : "腹腔镜下胆囊切除术，无胆总管探查（MCC）"
    }, {
        "code" : "418",
        "name" : "腹腔镜下胆囊切除术，无胆总管探查（CC）"
    }, {
        "code" : "419",
        "name" : "腹腔镜下胆囊切除术，无胆总管探查（-）"
    }, {
        "code" : "420",
        "name" : "肝、胆系统的诊断性手术（MCC）"
    }, {
        "code" : "421",
        "name" : "肝、胆系统的诊断性手术（CC）"
    }, {
        "code" : "422",
        "name" : "肝、胆系统的诊断性手术（-）"
    }, {
        "code" : "423",
        "name" : "其他肝、胆或胰腺的手术（MCC）"
    }, {
        "code" : "424",
        "name" : "其他肝、胆或胰腺的手术（CC）"
    }, {
        "code" : "425",
        "name" : "其他肝、胆或胰腺的手术（-）"
    }, {
        "code" : "432",
        "name" : "肝硬化和酒精性肝炎（MCC）"
    }, {
        "code" : "433",
        "name" : "肝硬化和酒精性肝炎（CC）"
    }, {
        "code" : "434",
        "name" : "肝硬化和酒精性肝炎（-）"
    }, {
        "code" : "435",
        "name" : "肝胆系统或胰腺恶性肿瘤（MCC）"
    }, {
        "code" : "436",
        "name" : "肝胆系统或胰腺恶性肿瘤（CC）"
    }, {
        "code" : "437",
        "name" : "肝胆系统或胰腺恶性肿瘤（-）"
    }, {
        "code" : "438",
        "name" : "恶性肿瘤外的胰腺疾病（MCC）"
    }, {
        "code" : "439",
        "name" : "恶性肿瘤外的胰腺疾病（CC）"
    }, {
        "code" : "440",
        "name" : "恶性肿瘤外的胰腺疾病（-）"
    }, {
        "code" : "441",
        "name" : "肝脏疾病（恶性肿瘤、肝硬化和酒精性肝炎除外）（MCC）"
    }, {
        "code" : "442",
        "name" : "肝脏疾病（恶性肿瘤、肝硬化和酒精性肝炎除外）（CC）"
    }, {
        "code" : "443",
        "name" : "肝脏疾病（恶性肿瘤、肝硬化和酒精性肝炎除外）（-）"
    }, {
        "code" : "444",
        "name" : "胆道疾病（MCC）"
    }, {
        "code" : "445",
        "name" : "胆道疾病（CC）"
    }, {
        "code" : "446",
        "name" : "胆道疾病（-）"
    } ],
    "code" : "7",
    "name" : "肝胆系统和胰腺疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "453",
        "name" : "前路、后路的脊椎联合融合术（MCC）"
    }, {
        "code" : "454",
        "name" : "前路、后路的脊椎联合融合术（CC）"
    }, {
        "code" : "455",
        "name" : "前路、后路的脊椎联合融合术（-）"
    }, {
        "code" : "456",
        "name" : "除颈椎外的脊柱融合术，伴脊椎弯曲/恶性肿瘤/感染/9处以上的融合（MCC）"
    }, {
        "code" : "457",
        "name" : "除颈椎外的脊柱融合术，伴脊椎弯曲/恶性肿瘤/感染/9处以上的融合（CC）"
    }, {
        "code" : "458",
        "name" : "除颈椎外的脊柱融合术，伴脊椎弯曲/恶性肿瘤/感染/9处以上的融合（-）"
    }, {
        "code" : "459",
        "name" : "除颈椎外的脊椎融合术（MCC）"
    }, {
        "code" : "460",
        "name" : "除颈椎外的脊椎融合术（-）"
    }, {
        "code" : "461",
        "name" : "下肢双侧或多处大关节手术（MCC）"
    }, {
        "code" : "462",
        "name" : "下肢双侧或多处大关节手术（-）"
    }, {
        "code" : "463",
        "name" : "肌肉骨骼和结缔组织疾病的伤口清创与皮肤移植，除手外（MCC）"
    }, {
        "code" : "464",
        "name" : "肌肉骨骼和结缔组织疾病的伤口清创与皮肤移植，除手外（CC）"
    }, {
        "code" : "465",
        "name" : "肌肉骨骼和结缔组织疾病的伤口清创与皮肤移植，除手外（-）"
    }, {
        "code" : "466",
        "name" : "髋关节或膝关节的翻修、置换（MCC）"
    }, {
        "code" : "467",
        "name" : "髋关节或膝关节的翻修、置换（CC）"
    }, {
        "code" : "468",
        "name" : "髋关节或膝关节的翻修、置换（-）"
    }, {
        "code" : "469",
        "name" : "下肢的大关节置换或复位（MCC）"
    }, {
        "code" : "470",
        "name" : "下肢的大关节置换或复位（-）"
    }, {
        "code" : "471",
        "name" : "颈椎融合术（MCC）"
    }, {
        "code" : "472",
        "name" : "颈椎融合术（CC）"
    }, {
        "code" : "473",
        "name" : "颈椎融合术（-）"
    }, {
        "code" : "474",
        "name" : "肌肉骨骼和结缔组织疾病的截肢术（MCC）"
    }, {
        "code" : "475",
        "name" : "肌肉骨骼和结缔组织疾病的截肢术（CC）"
    }, {
        "code" : "476",
        "name" : "肌肉骨骼和结缔组织疾病的截肢术（-）"
    }, {
        "code" : "477",
        "name" : "骨骼肌肉系统及结缔组织活检（MCC）"
    }, {
        "code" : "478",
        "name" : "骨骼肌肉系统及结缔组织活检（CC）"
    }, {
        "code" : "479",
        "name" : "骨骼肌肉系统及结缔组织活检（-）"
    }, {
        "code" : "480",
        "name" : "除大关节外的髋、股骨部位手术（MCC）"
    }, {
        "code" : "481",
        "name" : "除大关节外的髋、股骨部位手术（CC）"
    }, {
        "code" : "482",
        "name" : "除大关节外的髋、股骨部位手术（-）"
    }, {
        "code" : "483",
        "name" : "上肢大关节/肢体的复位操作"
    }, {
        "code" : "485",
        "name" : "主诊断为感染的膝关节手术（MCC）"
    }, {
        "code" : "486",
        "name" : "主诊断为感染的膝关节手术（CC）"
    }, {
        "code" : "487",
        "name" : "主诊断为感染的膝关节手术（-）"
    }, {
        "code" : "488",
        "name" : "主诊断不是感染的膝关节手术（CC/MCC）"
    }, {
        "code" : "489",
        "name" : "主诊断不是感染的膝关节手术（-）"
    }, {
        "code" : "492",
        "name" : "下肢和肱骨手术，除髋关节、足骨和股骨外（MCC）"
    }, {
        "code" : "493",
        "name" : "下肢和肱骨手术，除髋关节、足骨和股骨外（CC）"
    }, {
        "code" : "494",
        "name" : "下肢和肱骨手术，除髋关节、足骨和股骨外（-）"
    }, {
        "code" : "495",
        "name" : "髋、股骨外的局部骨切除及内固定器取出（MCC）"
    }, {
        "code" : "496",
        "name" : "髋、股骨外的局部骨切除及内固定器取出（CC）"
    }, {
        "code" : "497",
        "name" : "髋、股骨外的局部骨切除及内固定器取出（-）"
    }, {
        "code" : "498",
        "name" : "髋、股骨的局部骨切除及内固定器取出（CC/MCC）"
    }, {
        "code" : "499",
        "name" : "髋、股骨的局部骨切除及内固定器取出（-）"
    }, {
        "code" : "500",
        "name" : "软组织手术（MCC）"
    }, {
        "code" : "501",
        "name" : "软组织手术（CC）"
    }, {
        "code" : "502",
        "name" : "软组织手术（-）"
    }, {
        "code" : "503",
        "name" : "足部手术（MCC）"
    }, {
        "code" : "504",
        "name" : "足部手术（CC）"
    }, {
        "code" : "505",
        "name" : "足部手术（-）"
    }, {
        "code" : "506",
        "name" : "拇指骨或关节的手术"
    }, {
        "code" : "507",
        "name" : "肩部或肘部关节的手术（CC/MCC）"
    }, {
        "code" : "508",
        "name" : "肩部或肘部关节的手术（-）"
    }, {
        "code" : "509",
        "name" : "关节镜检查"
    }, {
        "code" : "510",
        "name" : "肩部、肘部或上肢手术，除大关节手术外（MCC）"
    }, {
        "code" : "511",
        "name" : "肩部、肘部或上肢手术，除大关节手术外（CC）"
    }, {
        "code" : "512",
        "name" : "肩部、肘部或上肢手术，除大关节手术外（-）"
    }, {
        "code" : "513",
        "name" : "手部或腕部手术，除拇指骨或大关节手术外（CC/MCC）"
    }, {
        "code" : "514",
        "name" : "手部或腕部手术，除拇指骨或大关节手术外（-）"
    }, {
        "code" : "515",
        "name" : "其他肌肉骨骼和结缔组织手术（MCC）"
    }, {
        "code" : "516",
        "name" : "其他肌肉骨骼和结缔组织手术（CC）"
    }, {
        "code" : "517",
        "name" : "其他肌肉骨骼和结缔组织手术（-）"
    }, {
        "code" : "518",
        "name" : "背部和颈椎手术，除脊椎融合外（MCC/DISC装置/神经刺激器）"
    }, {
        "code" : "519",
        "name" : "背部和颈椎手术，除脊椎融合外（CC）"
    }, {
        "code" : "520",
        "name" : "背部和颈椎手术，除脊椎融合外（-）"
    }, {
        "code" : "533",
        "name" : "股骨骨折（MCC）"
    }, {
        "code" : "534",
        "name" : "股骨骨折（-）"
    }, {
        "code" : "535",
        "name" : "髋骨和骨盆骨折（MCC）"
    }, {
        "code" : "536",
        "name" : "髋骨和骨盆骨折（-）"
    }, {
        "code" : "537",
        "name" : "髋骨、骨盆和大腿骨的扭伤、拉伤及脱臼（CC/MCC）"
    }, {
        "code" : "538",
        "name" : "髋骨、骨盆和大腿骨的扭伤、拉伤及脱臼（-）"
    }, {
        "code" : "539",
        "name" : "骨髓炎（MCC）"
    }, {
        "code" : "540",
        "name" : "骨髓炎（CC）"
    }, {
        "code" : "541",
        "name" : "骨髓炎（-）"
    }, {
        "code" : "542",
        "name" : "病理性骨折、肌肉骨骼和结缔组织恶性肿瘤（MCC）"
    }, {
        "code" : "543",
        "name" : "病理性骨折、肌肉骨骼和结缔组织恶性肿瘤（CC）"
    }, {
        "code" : "544",
        "name" : "病理性骨折、肌肉骨骼和结缔组织恶性肿瘤（-）"
    }, {
        "code" : "545",
        "name" : "结缔组织疾病（MCC）"
    }, {
        "code" : "546",
        "name" : "结缔组织疾病（CC）"
    }, {
        "code" : "547",
        "name" : "结缔组织疾病（-）"
    }, {
        "code" : "548",
        "name" : "化脓性关节炎（MCC）"
    }, {
        "code" : "549",
        "name" : "化脓性关节炎（CC）"
    }, {
        "code" : "550",
        "name" : "化脓性关节炎（-）"
    }, {
        "code" : "551",
        "name" : "内科性背部异常（MCC）"
    }, {
        "code" : "552",
        "name" : "内科性背部异常（-）"
    }, {
        "code" : "553",
        "name" : "骨骼及关节疾病（MCC）"
    }, {
        "code" : "554",
        "name" : "骨骼及关节疾病（-）"
    }, {
        "code" : "555",
        "name" : "肌肉骨骼和结缔组织的症状和体征（MCC）"
    }, {
        "code" : "556",
        "name" : "肌肉骨骼和结缔组织的症状和体征（-）"
    }, {
        "code" : "557",
        "name" : "肌腱炎，肌炎和滑囊炎（MCC）"
    }, {
        "code" : "558",
        "name" : "肌腱炎，肌炎和滑囊炎（-）"
    }, {
        "code" : "559",
        "name" : "肌肉骨骼和结缔组织的康复调养（MCC）"
    }, {
        "code" : "560",
        "name" : "肌肉骨骼和结缔组织的康复调养（CC）"
    }, {
        "code" : "561",
        "name" : "肌肉骨骼和结缔组织的康复调养（-）"
    }, {
        "code" : "562",
        "name" : "骨折扭伤、拉伤和错位，除股骨、髋关节、骨盆外（MCC）"
    }, {
        "code" : "563",
        "name" : "骨折扭伤、拉伤和错位，除股骨、髋关节、骨盆外（-）"
    }, {
        "code" : "564",
        "name" : "其他肌肉骨骼系统和结缔组织诊断（MCC）"
    }, {
        "code" : "565",
        "name" : "其他肌肉骨骼系统和结缔组织诊断（CC）"
    }, {
        "code" : "566",
        "name" : "其他肌肉骨骼系统和结缔组织诊断（-）"
    } ],
    "code" : "8",
    "name" : "肌肉骨骼系统和结缔组织疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "570",
        "name" : "皮肤清创（MCC）"
    }, {
        "code" : "571",
        "name" : "皮肤清创（CC）"
    }, {
        "code" : "572",
        "name" : "皮肤清创（-）"
    }, {
        "code" : "573",
        "name" : "皮肤溃疡或蜂窝织炎，行皮肤移植（MCC）"
    }, {
        "code" : "574",
        "name" : "皮肤溃疡或蜂窝织炎，行皮肤移植（CC）"
    }, {
        "code" : "575",
        "name" : "皮肤溃疡或蜂窝织炎，行皮肤移植（-）"
    }, {
        "code" : "576",
        "name" : "除皮肤溃疡或蜂窝织炎外的诊断，行皮肤移植（MCC）"
    }, {
        "code" : "577",
        "name" : "除皮肤溃疡或蜂窝织炎外的诊断，行皮肤移植（CC）"
    }, {
        "code" : "578",
        "name" : "除皮肤溃疡或蜂窝织炎外的诊断，行皮肤移植（-）"
    }, {
        "code" : "579",
        "name" : "其他皮肤、皮下组织和乳房手术（MCC）"
    }, {
        "code" : "580",
        "name" : "其他皮肤、皮下组织和乳房手术（CC）"
    }, {
        "code" : "581",
        "name" : "其他皮肤、皮下组织和乳房手术（-）"
    }, {
        "code" : "582",
        "name" : "乳房恶性肿瘤切除术（MCC/CC)"
    }, {
        "code" : "583",
        "name" : "乳房恶性肿瘤切除术（-)"
    }, {
        "code" : "584",
        "name" : "乳房活检、局部切除术和其他乳房非恶性肿瘤手术（MCC/CC）"
    }, {
        "code" : "585",
        "name" : "乳房活检、局部切除术和其他乳房非恶性肿瘤手术（-）"
    }, {
        "code" : "592",
        "name" : "皮肤溃疡（MCC）"
    }, {
        "code" : "593",
        "name" : "皮肤溃疡（CC）"
    }, {
        "code" : "594",
        "name" : "皮肤溃疡（-）"
    }, {
        "code" : "595",
        "name" : "重大皮肤疾病（MCC）"
    }, {
        "code" : "596",
        "name" : "重大皮肤疾病（-）"
    }, {
        "code" : "597",
        "name" : "皮肤、皮下组织和乳房恶性疾患（MCC）"
    }, {
        "code" : "598",
        "name" : "皮肤、皮下组织和乳房恶性疾患（CC）"
    }, {
        "code" : "599",
        "name" : "皮肤、皮下组织和乳房恶性疾患（-）"
    }, {
        "code" : "600",
        "name" : "皮肤、皮下组织和乳房非恶性疾患（MCC）"
    }, {
        "code" : "601",
        "name" : "皮肤、皮下组织和乳房非恶性疾患（-）"
    }, {
        "code" : "602",
        "name" : "蜂窝织炎（MCC）"
    }, {
        "code" : "603",
        "name" : "蜂窝织炎（-）"
    }, {
        "code" : "604",
        "name" : "皮肤、皮下组织及乳房的创伤（MCC）"
    }, {
        "code" : "605",
        "name" : "皮肤、皮下组织及乳房的创伤（-）"
    }, {
        "code" : "606",
        "name" : "轻度皮肤疾病（MCC）"
    }, {
        "code" : "607",
        "name" : "轻度皮肤疾病（-）"
    } ],
    "code" : "9",
    "name" : "皮肤、皮下组织和乳腺疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "614",
        "name" : "肾上腺及垂体手术（CC/MCC）"
    }, {
        "code" : "615",
        "name" : "肾上腺及垂体手术（-）"
    }, {
        "code" : "616",
        "name" : "内分泌、营养、代谢疾病，行下肢截肢（MCC）"
    }, {
        "code" : "617",
        "name" : "内分泌、营养、代谢疾病，行下肢截肢（CC）"
    }, {
        "code" : "618",
        "name" : "内分泌、营养、代谢疾病，行下肢截肢（-）"
    }, {
        "code" : "619",
        "name" : "肥胖手术（MCC）"
    }, {
        "code" : "620",
        "name" : "肥胖手术（CC）"
    }, {
        "code" : "621",
        "name" : "肥胖手术（-）"
    }, {
        "code" : "622",
        "name" : "内分泌、营养、代谢疾病，行植皮及清创（MCC）"
    }, {
        "code" : "623",
        "name" : "内分泌、营养、代谢疾病，行植皮及清创（CC）"
    }, {
        "code" : "624",
        "name" : "内分泌、营养、代谢疾病，行植皮及清创（-）"
    }, {
        "code" : "625",
        "name" : "甲状旁腺、甲状舌管及甲状腺手术（MCC）"
    }, {
        "code" : "626",
        "name" : "甲状旁腺、甲状舌管及甲状腺手术（CC）"
    }, {
        "code" : "627",
        "name" : "甲状旁腺、甲状舌管及甲状腺手术（-）"
    }, {
        "code" : "628",
        "name" : "内分泌、营养、代谢疾病的其他手术（MCC）"
    }, {
        "code" : "629",
        "name" : "内分泌、营养、代谢疾病的其他手术（CC）"
    }, {
        "code" : "630",
        "name" : "内分泌、营养、代谢疾病的其他手术（-）"
    }, {
        "code" : "637",
        "name" : "糖尿病（MCC）"
    }, {
        "code" : "638",
        "name" : "糖尿病（CC）"
    }, {
        "code" : "639",
        "name" : "糖尿病（-）"
    }, {
        "code" : "640",
        "name" : "营养、代谢，体液和电解质等其他障碍（MCC）"
    }, {
        "code" : "641",
        "name" : "营养、代谢，体液和电解质等其他障碍（-）"
    }, {
        "code" : "642",
        "name" : "先天性代谢异常"
    }, {
        "code" : "643",
        "name" : "内分泌失调（MCC）"
    }, {
        "code" : "644",
        "name" : "内分泌失调（CC）"
    }, {
        "code" : "645",
        "name" : "内分泌失调（-）"
    } ],
    "code" : "10",
    "name" : "内分泌、营养和代谢疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "652",
        "name" : "肾移植手术"
    }, {
        "code" : "653",
        "name" : "膀胱大型手术（MCC）"
    }, {
        "code" : "654",
        "name" : "膀胱大型手术（CC）"
    }, {
        "code" : "655",
        "name" : "膀胱大型手术（-）"
    }, {
        "code" : "656",
        "name" : "肾及输尿管肿瘤手术（MCC）"
    }, {
        "code" : "657",
        "name" : "肾及输尿管肿瘤手术（CC）"
    }, {
        "code" : "658",
        "name" : "肾及输尿管肿瘤手术（-）"
    }, {
        "code" : "659",
        "name" : "肾及输尿管的非肿瘤手术（MCC）"
    }, {
        "code" : "660",
        "name" : "肾及输尿管的非肿瘤手术（CC）"
    }, {
        "code" : "661",
        "name" : "肾及输尿管的非肿瘤手术（-）"
    }, {
        "code" : "662",
        "name" : "膀胱小型手术（MCC）"
    }, {
        "code" : "663",
        "name" : "膀胱小型手术（CC）"
    }, {
        "code" : "664",
        "name" : "膀胱小型手术（-）"
    }, {
        "code" : "665",
        "name" : "前列腺切除术（MCC）"
    }, {
        "code" : "666",
        "name" : "前列腺切除术（CC）"
    }, {
        "code" : "667",
        "name" : "前列腺切除术（-）"
    }, {
        "code" : "668",
        "name" : "经由尿道的手术（MCC）"
    }, {
        "code" : "669",
        "name" : "经由尿道的手术（CC）"
    }, {
        "code" : "670",
        "name" : "经由尿道的手术（-）"
    }, {
        "code" : "671",
        "name" : "尿道手术（CC/MCC）"
    }, {
        "code" : "672",
        "name" : "尿道手术（-）"
    }, {
        "code" : "673",
        "name" : "其他的肾脏及尿道手术（MCC）"
    }, {
        "code" : "674",
        "name" : "其他的肾脏及尿道手术（CC）"
    }, {
        "code" : "675",
        "name" : "其他的肾脏及尿道手术（-）"
    }, {
        "code" : "682",
        "name" : "肾衰竭（MCC）"
    }, {
        "code" : "683",
        "name" : "肾衰竭（CC）"
    }, {
        "code" : "684",
        "name" : "肾衰竭（-）"
    }, {
        "code" : "685",
        "name" : "住院肾透析"
    }, {
        "code" : "686",
        "name" : "肾脏及尿道肿瘤（MCC）"
    }, {
        "code" : "687",
        "name" : "肾脏及尿道肿瘤（CC）"
    }, {
        "code" : "688",
        "name" : "肾脏及尿道肿瘤（-）"
    }, {
        "code" : "689",
        "name" : "肾脏与尿道感染（MCC）"
    }, {
        "code" : "690",
        "name" : "肾脏与尿道感染（-）"
    }, {
        "code" : "691",
        "name" : "泌尿道结石，体外冲击波碎石（CC/MCC）"
    }, {
        "code" : "692",
        "name" : "泌尿道结石，体外冲击波碎石（-）"
    }, {
        "code" : "693",
        "name" : "泌尿道结石，非体外冲击波碎石（MCC）"
    }, {
        "code" : "694",
        "name" : "泌尿道结石，非体外冲击波碎石（-）"
    }, {
        "code" : "695",
        "name" : "肾脏和尿道症状和体征（MCC）"
    }, {
        "code" : "696",
        "name" : "肾脏和尿道症状和体征（-）"
    }, {
        "code" : "697",
        "name" : "尿道狭窄"
    }, {
        "code" : "698",
        "name" : "其他肾脏和尿道诊断（MCC）"
    }, {
        "code" : "699",
        "name" : "其他肾脏和尿道诊断（CC）"
    }, {
        "code" : "700",
        "name" : "其他肾脏和尿道诊断（-）"
    } ],
    "code" : "11",
    "name" : "肾脏和泌尿道疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "707",
        "name" : "男性盆腔手术（CC/MCC)"
    }, {
        "code" : "708",
        "name" : "男性盆腔手术（-)"
    }, {
        "code" : "709",
        "name" : "阴茎手术（CC/MCC)"
    }, {
        "code" : "710",
        "name" : "阴茎手术（-)"
    }, {
        "code" : "711",
        "name" : "睾丸手术（CC/MCC)"
    }, {
        "code" : "712",
        "name" : "睾丸手术（-)"
    }, {
        "code" : "713",
        "name" : "经尿道的前列腺切除术（CC/MCC)"
    }, {
        "code" : "714",
        "name" : "经尿道的前列腺切除术（-)"
    }, {
        "code" : "715",
        "name" : "其他男性生殖系统恶性肿瘤手术（CC/MCC）"
    }, {
        "code" : "716",
        "name" : "其他男性生殖系统恶性肿瘤手术（-）"
    }, {
        "code" : "717",
        "name" : "除恶性肿瘤外的其他男性生殖系统手术（CC/MCC）"
    }, {
        "code" : "718",
        "name" : "除恶性肿瘤外的其他男性生殖系统手术（-）"
    }, {
        "code" : "722",
        "name" : "男性生殖系统恶性肿瘤（MCC）"
    }, {
        "code" : "723",
        "name" : "男性生殖系统恶性肿瘤（CC）"
    }, {
        "code" : "724",
        "name" : "男性生殖系统恶性肿瘤（-）"
    }, {
        "code" : "725",
        "name" : "良性前列腺增生（MCC）"
    }, {
        "code" : "726",
        "name" : "良性前列腺增生（-）"
    }, {
        "code" : "727",
        "name" : "男性生殖系统炎症（MCC）"
    }, {
        "code" : "728",
        "name" : "男性生殖系统炎症（-）"
    }, {
        "code" : "729",
        "name" : "其他男性生殖系统诊断（CC/MCC）"
    }, {
        "code" : "730",
        "name" : "其他男性生殖系统诊断（-）"
    } ],
    "code" : "12",
    "name" : "男性生殖系统疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "734",
        "name" : "盆腔脏器摘除术、根治性子宫切除术及外阴切除术（CC/MCC)"
    }, {
        "code" : "735",
        "name" : "盆腔脏器摘除术、根治性子宫切除术及外阴切除术（-)"
    }, {
        "code" : "736",
        "name" : "卵巢或附件恶性肿瘤下的子宫及附件手术（MCC）"
    }, {
        "code" : "737",
        "name" : "卵巢或附件恶性肿瘤下的子宫及附件手术（CC）"
    }, {
        "code" : "738",
        "name" : "卵巢或附件恶性肿瘤下的子宫及附件手术（-）"
    }, {
        "code" : "739",
        "name" : "除卵巢或附件外恶性肿瘤下的子宫及附件手术（MCC）"
    }, {
        "code" : "740",
        "name" : "除卵巢或附件外恶性肿瘤下的子宫及附件手术（CC）"
    }, {
        "code" : "741",
        "name" : "除卵巢或附件外恶性肿瘤下的子宫及附件手术（-）"
    }, {
        "code" : "742",
        "name" : "非恶性肿瘤的子宫及附件手术（CC/MCC）"
    }, {
        "code" : "743",
        "name" : "非恶性肿瘤的子宫及附件手术（-）"
    }, {
        "code" : "744",
        "name" : "宫颈扩张及刮宫术、宫颈锥切术、腹腔镜下输卵管阻塞切开术（CC/MCC)"
    }, {
        "code" : "745",
        "name" : "宫颈扩张及刮宫术、宫颈锥切术、腹腔镜下输卵管阻塞切开术（-)"
    }, {
        "code" : "746",
        "name" : "阴道、宫颈及外阴手术（CC/MCC)"
    }, {
        "code" : "747",
        "name" : "阴道、宫颈及外阴手术（-)"
    }, {
        "code" : "748",
        "name" : "女性生殖系统重建手术"
    }, {
        "code" : "749",
        "name" : "其他女性生殖系统手术（CC/MCC)"
    }, {
        "code" : "750",
        "name" : "其他女性生殖系统手术（-)"
    }, {
        "code" : "754",
        "name" : "女性生殖系统恶性肿瘤（MCC）"
    }, {
        "code" : "755",
        "name" : "女性生殖系统恶性肿瘤（CC）"
    }, {
        "code" : "756",
        "name" : "女性生殖系统恶性肿瘤（-）"
    }, {
        "code" : "757",
        "name" : "女性生殖系统感染（MCC）"
    }, {
        "code" : "758",
        "name" : "女性生殖系统感染（CC）"
    }, {
        "code" : "759",
        "name" : "女性生殖系统感染（-）"
    }, {
        "code" : "760",
        "name" : "经期及其他女性生殖系统疾病（CC/MCC）"
    }, {
        "code" : "761",
        "name" : "经期及其他女性生殖系统疾病（-）"
    } ],
    "code" : "13",
    "name" : "女性生殖系统疾病及功能障碍"
}, {
    "children" : [ {
        "code" : "765",
        "name" : "剖宫产（CC/MCC)"
    }, {
        "code" : "766",
        "name" : "剖宫产（-)"
    }, {
        "code" : "767",
        "name" : "阴道分娩伴绝育及/或宫颈扩张、刮宫手术"
    }, {
        "code" : "768",
        "name" : "阴道分娩手术，除绝育及/或宫颈扩张、刮宫手术外"
    }, {
        "code" : "769",
        "name" : "产后、流产后的诊断，伴手术"
    }, {
        "code" : "770",
        "name" : "流产，伴宫颈扩张及刮宫、吸引刮宫或子宫切开术"
    }, {
        "code" : "774",
        "name" : "阴道分娩，伴复合诊断"
    }, {
        "code" : "775",
        "name" : "阴道分娩，无复合诊断"
    }, {
        "code" : "776",
        "name" : "产后、流产后的诊断，无手术"
    }, {
        "code" : "777",
        "name" : "异位妊娠"
    }, {
        "code" : "778",
        "name" : "先兆流产"
    }, {
        "code" : "779",
        "name" : "流产，无宫颈扩张及刮宫"
    }, {
        "code" : "780",
        "name" : "假分娩"
    }, {
        "code" : "781",
        "name" : "其他产前诊断，伴内科并发症"
    }, {
        "code" : "782",
        "name" : "其他产前诊断，无内科并发症"
    } ],
    "code" : "14",
    "name" : "妊娠、分娩和产褥期"
}, {
    "children" : [ {
        "code" : "789",
        "name" : "新生儿死亡或转入另一急诊科医院"
    }, {
        "code" : "790",
        "name" : "极度发育不全，或有呼吸窘迫综合征的新生儿"
    }, {
        "code" : "791",
        "name" : "早产儿，伴重大问题"
    }, {
        "code" : "792",
        "name" : "早产儿，无重大问题"
    }, {
        "code" : "793",
        "name" : "足月新生儿，伴重大问题"
    }, {
        "code" : "794",
        "name" : "新生儿，伴其他显著问题"
    }, {
        "code" : "795",
        "name" : "正常新生儿"
    } ],
    "code" : "15",
    "name" : "新生儿及其他起源于围生期的新生儿疾病"
}, {
    "children" : [ {
        "code" : "799",
        "name" : "脾脏切除术（MCC）"
    }, {
        "code" : "800",
        "name" : "脾脏切除术（CC）"
    }, {
        "code" : "801",
        "name" : "脾脏切除术（-）"
    }, {
        "code" : "802",
        "name" : "血液及造血器官的其他手术（MCC）"
    }, {
        "code" : "803",
        "name" : "血液及造血器官的其他手术（CC）"
    }, {
        "code" : "804",
        "name" : "血液及造血器官的其他手术（-）"
    }, {
        "code" : "808",
        "name" : "重大血液学和免疫学诊断，除镰状细胞危象和凝血障碍外（MCC）"
    }, {
        "code" : "809",
        "name" : "重大血液学和免疫学诊断，除镰状细胞危象和凝血障碍外（CC）"
    }, {
        "code" : "810",
        "name" : "重大血液学和免疫学诊断，除镰状细胞危象和凝血障碍外（-）"
    }, {
        "code" : "811",
        "name" : "血红细胞疾病（MCC）"
    }, {
        "code" : "812",
        "name" : "血红细胞疾病（-）"
    }, {
        "code" : "813",
        "name" : "凝血障碍"
    }, {
        "code" : "814",
        "name" : "网状内皮及免疫性疾患（MCC）"
    }, {
        "code" : "815",
        "name" : "网状内皮及免疫性疾患（CC）"
    }, {
        "code" : "816",
        "name" : "网状内皮及免疫性疾患（-）"
    } ],
    "code" : "16",
    "name" : "血液及造血器官疾病和功能障碍及免疫障碍"
}, {
    "children" : [ {
        "code" : "820",
        "name" : "淋巴瘤及白血病，伴重大手术（MCC）"
    }, {
        "code" : "821",
        "name" : "淋巴瘤及白血病，伴重大手术（CC）"
    }, {
        "code" : "822",
        "name" : "淋巴瘤及白血病，伴重大手术（-）"
    }, {
        "code" : "823",
        "name" : "淋巴瘤及白血病，伴其他手术（MCC）"
    }, {
        "code" : "824",
        "name" : "淋巴瘤及白血病，伴其他手术（CC）"
    }, {
        "code" : "825",
        "name" : "淋巴瘤及白血病，伴其他手术（-）"
    }, {
        "code" : "826",
        "name" : "骨髓增生性疾病或低分化肿瘤，伴重大手术（MCC）"
    }, {
        "code" : "827",
        "name" : "骨髓增生性疾病或低分化肿瘤，伴重大手术（CC）"
    }, {
        "code" : "828",
        "name" : "骨髓增生性疾病或低分化肿瘤，伴重大手术（-）"
    }, {
        "code" : "829",
        "name" : "骨髓增生性疾病或低分化肿瘤，伴其他手术（CC/MCC)"
    }, {
        "code" : "830",
        "name" : "骨髓增生性疾病或低分化肿瘤，伴其他手术（-)"
    }, {
        "code" : "834",
        "name" : "急性白血病，无重大手术（MCC）"
    }, {
        "code" : "835",
        "name" : "急性白血病，无重大手术（CC）"
    }, {
        "code" : "836",
        "name" : "急性白血病，无重大手术（-）"
    }, {
        "code" : "837",
        "name" : "化疗，伴SDX为急性白血病、或使用高剂量化疗药物（MCC）"
    }, {
        "code" : "838",
        "name" : "化疗，伴SDX为急性白血病、或使用高剂量化疗药物（CC）"
    }, {
        "code" : "839",
        "name" : "化疗，伴SDX为急性白血病（-）"
    }, {
        "code" : "840",
        "name" : "淋巴瘤及非急性白血病（MCC）"
    }, {
        "code" : "841",
        "name" : "淋巴瘤及非急性白血病（CC）"
    }, {
        "code" : "842",
        "name" : "淋巴瘤及非急性白血病（-）"
    }, {
        "code" : "843",
        "name" : "其他骨髓增生性疾病或低分化肿瘤（MCC）"
    }, {
        "code" : "844",
        "name" : "其他骨髓增生性疾病或低分化肿瘤（CC）"
    }, {
        "code" : "845",
        "name" : "其他骨髓增生性疾病或低分化肿瘤（-）"
    }, {
        "code" : "846",
        "name" : "化疗，SDX不是急性白血病（MCC）"
    }, {
        "code" : "847",
        "name" : "化疗，SDX不是急性白血病（CC）"
    }, {
        "code" : "848",
        "name" : "化疗，SDX不是急性白血病（-）"
    }, {
        "code" : "849",
        "name" : "恶性增生性疾病的放射治疗"
    } ],
    "code" : "17",
    "name" : "骨髓增生性疾病及功能障碍和低分化肿瘤"
}, {
    "children" : [ {
        "code" : "853",
        "name" : "传染病与寄生虫病手术（MCC）"
    }, {
        "code" : "854",
        "name" : "传染病与寄生虫病手术（CC）"
    }, {
        "code" : "855",
        "name" : "传染病与寄生虫病手术（-）"
    }, {
        "code" : "856",
        "name" : "手术后及创伤后感染，伴手术（MCC）"
    }, {
        "code" : "857",
        "name" : "手术后及创伤后感染，伴手术（CC）"
    }, {
        "code" : "858",
        "name" : "手术后及创伤后感染，伴手术（-）"
    }, {
        "code" : "862",
        "name" : "手术后及创伤后感染（MCC）"
    }, {
        "code" : "863",
        "name" : "手术后及创伤后感染（-）"
    }, {
        "code" : "864",
        "name" : "发热原因不明"
    }, {
        "code" : "865",
        "name" : "病毒性疾病（MCC）"
    }, {
        "code" : "866",
        "name" : "病毒性疾病（-）"
    }, {
        "code" : "867",
        "name" : "其他传染病和寄生虫病诊断（MCC）"
    }, {
        "code" : "868",
        "name" : "其他传染病和寄生虫病诊断（CC）"
    }, {
        "code" : "869",
        "name" : "其他传染病和寄生虫病诊断（-）"
    }, {
        "code" : "870",
        "name" : "败血症或脓毒症，伴MV 96小时"
    }, {
        "code" : "871",
        "name" : "败血症或脓毒症，不伴MV 96小时（MCC）"
    }, {
        "code" : "872",
        "name" : "败血症或脓毒症，不伴MV 96小时（-）"
    } ],
    "code" : "18",
    "name" : "传染性疾病和寄生虫病"
}, {
    "children" : [ {
        "code" : "876",
        "name" : "PDX为精神疾病的手术室操作"
    }, {
        "code" : "880",
        "name" : "急性调节反应及心理障碍"
    }, {
        "code" : "881",
        "name" : "抑郁性神经症"
    }, {
        "code" : "882",
        "name" : "除抑郁外的神经症"
    }, {
        "code" : "883",
        "name" : "人格与及冲动控制障碍"
    }, {
        "code" : "884",
        "name" : "器官功能紊乱与智力低下"
    }, {
        "code" : "885",
        "name" : "精神病"
    }, {
        "code" : "886",
        "name" : "行为及发育障碍"
    }, {
        "code" : "887",
        "name" : "其他精神障碍诊断"
    } ],
    "code" : "19",
    "name" : "精神疾病和障碍"
}, {
    "children" : [ {
        "code" : "894",
        "name" : "酒精、药物滥用或依赖、违背医嘱"
    }, {
        "code" : "895",
        "name" : "酒精、药物滥用或依赖，伴康复治疗"
    }, {
        "code" : "896",
        "name" : "酒精、药物滥用或依赖，无康复治疗（MCC）"
    }, {
        "code" : "897",
        "name" : "酒精、药物滥用或依赖，无康复治疗（-）"
    } ],
    "code" : "20",
    "name" : "酒精/药物滥用和酒精/药物引起的器质性精神障碍"
}, {
    "children" : [ {
        "code" : "901",
        "name" : "外伤的清创术（MCC）"
    }, {
        "code" : "902",
        "name" : "外伤的清创术（CC）"
    }, {
        "code" : "903",
        "name" : "外伤的清创术（-）"
    }, {
        "code" : "904",
        "name" : "外伤的皮肤移植（CC/MCC)"
    }, {
        "code" : "905",
        "name" : "外伤的皮肤移植（-)"
    }, {
        "code" : "906",
        "name" : "手外伤手术"
    }, {
        "code" : "907",
        "name" : "其他外伤的手术（MCC）"
    }, {
        "code" : "908",
        "name" : "其他外伤的手术（CC）"
    }, {
        "code" : "909",
        "name" : "其他外伤的手术（-）"
    }, {
        "code" : "913",
        "name" : "外伤诊断（MCC）"
    }, {
        "code" : "914",
        "name" : "外伤诊断（-）"
    }, {
        "code" : "915",
        "name" : "过敏反应（MCC）"
    }, {
        "code" : "916",
        "name" : "过敏反应（-）"
    }, {
        "code" : "917",
        "name" : "药物及其他物质中毒/毒性反应（MCC）"
    }, {
        "code" : "918",
        "name" : "药物及其他物质中毒/毒性反应（-）"
    }, {
        "code" : "919",
        "name" : "并发症治疗（MCC）"
    }, {
        "code" : "920",
        "name" : "并发症治疗（CC）"
    }, {
        "code" : "921",
        "name" : "并发症治疗（-）"
    }, {
        "code" : "922",
        "name" : "其他外伤、中毒及毒性反应诊断（MCC）"
    }, {
        "code" : "923",
        "name" : "其他外伤、中毒及毒性反应诊断（-）"
    } ],
    "code" : "21",
    "name" : "损伤、中毒和药物的毒性反应"
}, {
    "children" : [ {
        "code" : "927",
        "name" : "大面积烧伤，或全层烧伤，伴96小时以上机械通气，伴皮肤移植"
    }, {
        "code" : "928",
        "name" : "全层烧伤，伴皮肤移植或吸入性损伤（CC/MCC)"
    }, {
        "code" : "929",
        "name" : "全层烧伤，伴皮肤移植或吸入性损伤（-)"
    }, {
        "code" : "933",
        "name" : "大面积烧伤，或全层烧伤，伴96小时以上机械通气，无皮肤移植"
    }, {
        "code" : "934",
        "name" : "全层烧伤，无皮肤移植或吸入性损伤"
    }, {
        "code" : "935",
        "name" : "非大面积烧伤"
    } ],
    "code" : "22",
    "name" : "烧伤"
}, {
    "children" : [ {
        "code" : "939",
        "name" : "其他接触健康服务的诊断，伴手术（MCC）"
    }, {
        "code" : "940",
        "name" : "其他接触健康服务的诊断，伴手术（CC）"
    }, {
        "code" : "941",
        "name" : "其他接触健康服务的诊断，伴手术（-）"
    }, {
        "code" : "945",
        "name" : "康复（CC/MCC)"
    }, {
        "code" : "946",
        "name" : "康复（-)"
    }, {
        "code" : "947",
        "name" : "症状和体征（MCC）"
    }, {
        "code" : "948",
        "name" : "症状和体征（-）"
    }, {
        "code" : "949",
        "name" : "恢复期照护（CC/MCC)"
    }, {
        "code" : "950",
        "name" : "恢复期照护（-)"
    }, {
        "code" : "951",
        "name" : "其他影响健康状态的因素"
    } ],
    "code" : "23",
    "name" : "影响健康状况的因素和其他与保健机构的接触"
}, {
    "children" : [ {
        "code" : "955",
        "name" : "多发重大外伤的开颅术"
    }, {
        "code" : "956",
        "name" : "多发重大外伤的髋、股手术或上臂再接手术"
    }, {
        "code" : "957",
        "name" : "多发重大外伤的其他手术（MCC）"
    }, {
        "code" : "958",
        "name" : "多发重大外伤的其他手术（CC）"
    }, {
        "code" : "959",
        "name" : "多发重大外伤的其他手术（-）"
    }, {
        "code" : "963",
        "name" : "多发重大外伤的诊断（MCC）"
    }, {
        "code" : "964",
        "name" : "多发重大外伤的诊断（CC）"
    }, {
        "code" : "965",
        "name" : "多发重大外伤的诊断（-）"
    } ],
    "code" : "24",
    "name" : "多重严重外伤"
}, {
    "children" : [ {
        "code" : "969",
        "name" : "伴HIV的普通手术（MCC）"
    }, {
        "code" : "970",
        "name" : "伴HIV的普通手术（-）"
    }, {
        "code" : "974",
        "name" : "HIV，伴重大相关状况（MCC）"
    }, {
        "code" : "975",
        "name" : "HIV，重大相关状况（CC）"
    }, {
        "code" : "976",
        "name" : "HIV，重大相关状况（-）"
    }, {
        "code" : "977",
        "name" : "HIV，伴有或无其他相关状况"
    } ],
    "code" : "25",
    "name" : "HIV病毒感染"
}, {
    "children" : [ {
        "code" : "981",
        "name" : "与主诊断不相关的常见手术（MCC）"
    }, {
        "code" : "982",
        "name" : "与主诊断不相关的常见手术（CC）"
    }, {
        "code" : "983",
        "name" : "与主诊断不相关的常见手术（-）"
    }, {
        "code" : "984",
        "name" : "与主诊断不相关的前列腺手术（MCC）"
    }, {
        "code" : "985",
        "name" : "与主诊断不相关的前列腺手术（CC）"
    }, {
        "code" : "986",
        "name" : "与主诊断不相关的前列腺手术（-）"
    }, {
        "code" : "987",
        "name" : "与主诊断不相关的特殊手术（MCC）"
    }, {
        "code" : "988",
        "name" : "与主诊断不相关的特殊手术（CC）"
    }, {
        "code" : "989",
        "name" : "与主诊断不相关的特殊手术（-）"
    }, {
        "code" : "998",
        "name" : "诊断无效的出院诊断"
    }, {
        "code" : "999",
        "name" : "无法分组的病例诊断"
    } ],
    "code" : "26",
    "name" : "无法分组的病例"
} ];

//返回对象数组是定值的下标
function indexOfObjArr(dataArr, key, value){
    var index = -1;
    for(var i=0, arrSize=dataArr.length; i<arrSize;i++){
        var curObj = dataArr[i];
        if(curObj[key] == value){
            index = i;
            break;
        }
    }
    return index;
}

//输入选项加载
function inOptsFun(options){
    var allOptObj = {"code": " ", "name": "全部"};
    var defOption = {
        id: "#",
        data: [],
        hasAll: false,
        selectOpt: null
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        var $optList = $(setting.id);
        //数组数据
        this.data = function(){
            var dataArr = [];
            //加载列表
            if(setting.hasAll == true){
                dataArr = dataArr.concat(allOptObj, setting.data);
            }else{
                dataArr = setting.data;
            }
            return dataArr;
        };
        //列表
        this.list = function(){
            $optList.hide().html("");
            var optLiElem = document.createElement("span");
            optLiElem.className = "inopt-li";
            var aElem = document.createElement("a");
            optLiElem.appendChild(aElem);
            var dataArr = this.data();
            for(var i=0, arrSize = dataArr.length; i<arrSize; i++){
                var curObj = dataArr[i];
                var optLiClone = optLiElem.cloneNode(true);
                var optAElem = optLiClone.getElementsByTagName("a")[0];
                optAElem.setAttribute("data-id", curObj['code']);
                optAElem.innerHTML = curObj['name'];
                $optList.append(optLiClone);
            }
            //显示列表
            $optList.show();
            //注册点击事件
            $optList.on('click', 'a', function(){
                var $this = $(this);
                var on = "on";
                var $inoptCon = $this.parents(".inopt-con");
                var $opts = $optList.find("a");
                $opts.removeClass(on); $this.addClass(on);
                $inoptCon.attr("data-select", $this.attr("data-id"));
            });
        };
        //加载点击事件和选中项
        this.load = function(){
            this.list();
            //选中项
            var index = 0;
            if((setting.hasAll == false)&&(setting.selectOpt == " ")){
                setting.selectOpt = null;
            }
            var dataArr = this.data();
            index = indexOfObjArr(dataArr, "code", setting.selectOpt);
            index = (index >= 0) ? index : 0;
            $optList.find("a").eq(index).trigger('click');
        };
    }
}

//生成标签内容关联
function relateTabAndList(options){
    var defOption = {
        tabId: "#",
        conId: "#",
        data: []
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        var dataArr = setting.data;
        var dataTabArr = [];
        //con内容列表
        var $tabElem = $(setting.tabId);
        var $conElem = $(setting.conId);
        var optList = document.createElement("div");
        optList.className = "inopt-list";
        $conElem.hide().html("");
        var tabSize = dataArr.length;
        for(var i=0; i<tabSize; i++){
            var curObj = dataArr[i];
            var tmpObj = {
                'code': curObj['code'],
                'name': curObj['name']
            };
            dataTabArr.push(tmpObj);
            var curChildren = curObj['children'];
            if(curChildren.length > 0){
                var optListCon = optList.cloneNode(true);
                new inOptsFun({
                    id: optListCon,
                    data: curChildren,
                    hasAll: true
                }).list();
                $conElem.append(optListCon);
            }
        }
        $conElem.show();
        //tab标签列表
        if(dataTabArr.length > 0){
            new inOptsFun({
                id: setting.tabId,
                data: dataTabArr
            }).list();
        }
        //关联标签菜单点击
        $tabElem.on('click', "a",function(){
            var on = "on";
            var $tabOptA = $tabElem.find("a");
            var index = $tabOptA.index(this);
            var $conList = $conElem.find(".inopt-list");
            $conList.hide().eq(index).show();
        });
        //关联所有列表点击
        $conElem.on('click', "a",function(){
            var on = "on";
            var $conListA = $conElem.find("a");
            $conListA.removeClass(on);
            $(this).addClass(on);
        });
        //默认选中第一个
        $tabElem.find("a").eq(0).trigger('click');
        $conElem.find("a").eq(0).trigger('click');
    }
}

//时间类型列表
function TimeTypeList(options){
    var defOption = {
        id: "#timeTypeList",
        data: dataTimeType
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        new inOptsFun({
            id: setting.id,
            data: setting.data
        }).load();
    }
}

//医院等级列表
function HospDegreeList(options){
    var defOption = {
        id: "#hospDegreeList",
        data: dataHospitalDegree
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        new inOptsFun({
            id: setting.id,
            data: setting.data,
            hasAll: true
        }).load();
    }
}

//Mdc列表
function MdcList(options){
    var defOption = {
        id: "#mdcList"
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        $.ajax({
            type: "post",
            url: "common/mdcDrgList",
            dataType:"jsonp",
            data: "",
            async: false,
            jsonp: "callback",
            success:function(data){
                var jsonData = eval(data);
                var dataArr = jsonData;
                var dataTabArr = [];
                var tabSize = dataArr.length;
                for(var i=0; i<tabSize; i++){
                    var curObj = dataArr[i];
                    var tmpObj = {
                        'code': curObj['code'],
                        'name': curObj['name']
                    };
                    dataTabArr.push(tmpObj);
                }
                //tab标签列表
                if(dataTabArr.length > 0){
                    new inOptsFun({
                        id: setting.id,
                        data: dataTabArr,
                        hasAll: true
                    }).load();
                }
            },
            error:function(error){
                console.log(error);
            }
        });
    }
}

//MdcDrgs列表
function MdcDrgsList(options){
    var defOption = {
        mdcId: "#mdcList",
        drgId: "#drgsRes"
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        $.ajax({
            type: "post",
            url: "common/mdcDrgList",
            dataType:"jsonp",
            data: "",
            async: false,
            jsonp: "callback",
            success:function(data){
                var jsonData = eval(data);
                relateTabAndList({
                    tabId: setting.mdcId,
                    conId: setting.drgId,
                    data: jsonData
                });
            },
            error:function(error){
                console.log(error);
            }
        });
    }
}

//专科列表
function DepaList(options){
    var defOption = {
        id: "#depaList",
        data: dataHospitalDegree
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        $.ajax({
            type: "post",
            url: "common/depa",
            dataType:"jsonp",
            data: "",
            async: false,
            jsonp: "callback",
            success:function(data){
                var jsonData = eval(data);
                new inOptsFun({
                    id: setting.id,
                    data: jsonData
                }).load();
            },
            error:function(error){
                console.log(error);
            }
        });
    }
}

//专科 与 MDC 切换
function depaAndMdc(options){
    //医疗专科
    DepaList();
    //MDC分类
    MdcDrgsList();
    //标签列表
    var defOption = {
        tabId: "#analyTypeList",
        conId: "#analyTypeListRes",
        data: dataAnalyType
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        new inOptsFun({
            id: setting.tabId,
            data: setting.data
        }).load();
        var $tabElem = $(setting.tabId);
        var $conElem = $(setting.conId);
        //关联标签菜单点击
        $tabElem.on('click', "a",function(){
            var on = "on";
            var $tabOptA = $tabElem.find("a");
            var index = $tabOptA.index(this);
            var $conList = $conElem.find(".inopt-list");
            $conList.hide().eq(index).show();
            //切换DRGs列表
            var $drgsOpt = $("#drgsOption");
            if(index == 0){
                $drgsOpt.hide();
            }
            else{
                $drgsOpt.show();
            }
        });
        //关联所有列表点击
        $conElem.on('click', ".inopt-list a", function(){
            var on = "on";
            var $conListA = $conElem.find(".inopt-list a");
            $conListA.removeClass(on);
            $(this).addClass(on);
        });
        //默认选中第一个
        $tabElem.find("a").eq(0).trigger('click');
        $conElem.find("a").eq(0).trigger('click');
    }
}
//指标类型
function indexTypeLoad(options){
    var defOption = {
        tabId: "#indexTypeList",
        conId: "#indexTypeListRes",
        data: dataIndexType
    };
    if (options === undefined){options = {};}
    if (typeof(options) === "object") {
        var setting = $.extend(true, {}, defOption, options);
        //生成列表
        relateTabAndList({
            tabId: setting.tabId,
            conId: setting.conId,
            data: setting.data
        });
    }
}

//医院等级列表初始化
function hospDegreeInit($elem, setting){
    //默认值(有"全部")
    var allTrueOpt = {
        hasAll: true,
        defId: ""  //全部
    };
    //默认值(没有"全部")
    var allFlaseOpt = {
        hasAll: false,
        defId: false
    };
    var defOpt = allTrueOpt; //默认使用(有"全部")
    $elem.empty();
    var allBool = defOpt.hasAll;
    if((typeof(setting) === "object")&&(typeof(setting.hasAll) === "boolean")){
        allBool = setting.hasAll;
    }
    if(allBool){
        $elem.append("<option value=''>"+"全部"+"</option>");
    }
    $.each(hospitalDegree, function(index, obj) {
        $elem.append("<option value="+obj.value+">"+obj.name+"</option>");
    });
    $elem.select2({minimumResultsForSearch: -1});
}

//时间类型
var timeTypeOpts = [
    {"value": "0", "text": "月份"},
    {"value": "1", "text": "年度"}
];
//时间类型初始化
function initTimeType($timeType){
    $timeType.empty();
    for(var i=0,arrSize=timeTypeOpts.length;i<arrSize;i++){
        var curOpt = timeTypeOpts[i];
        $timeType.append("<option value="+curOpt.value+">"+curOpt.text+"</option>");
    }
}

//指标选择
var indexOpts = [
    {
        "label": "数量指标",
        "children": [
            {"value": "0.0", "text": "住院收入", "unit": "(万元)"},
            {"value": "0.1", "text": "病例数", "unit": "(人次)"},
            {"value": "0.2", "text": "出院人数", "unit": "(人)"},
            {"value": "0.3", "text": "DRGs组数", "unit": "(组)"},
            {"value": "0.4", "text": "手术人次", "unit": "(人次)"},
            {"value": "0.5", "text": "三四级手术人次", "unit": "(人次)"}
        ]
    },
    {
        "label": "质量指标",
        "children": [
            {"value": "1.0", "text": "平均住院天数", "unit": "(天)"},
            {"value": "1.1", "text": "术前平均住院日", "unit": "(天)"},
            {"value": "1.2", "text": "入出院诊断符合率", "unit": "(%)"},
            {"value": "1.3", "text": "死亡率", "unit": "(%)"},
            {"value": "1.4", "text": "中低风险疾病死亡率", "unit": "(%)"},
            {"value": "1.5", "text": "治愈好转率", "unit": "(%)"},
            {"value": "1.6", "text": "院内感染率", "unit": "(%)"},
            {"value": "1.7", "text": "手术重复率", "unit": "(%)"}
        ]
    },
    {
        "label": "费用指标",
        "children": [
            {"value": "2.0", "text": "次均费用", "unit": "(元)"},
            {"value": "2.1", "text": "人均费用", "unit": "(元)"},
            {"value": "2.2", "text": "医保患者自费率", "unit": "(%)"},
            {"value": "2.3", "text": "药占比", "unit": "(%)"},
            {"value": "2.4", "text": "抗生素使用率", "unit": "(%)"},
            {"value": "2.5", "text": "三线抗生素使用率", "unit": "(%)"},
            {"value": "2.6", "text": "高耗比", "unit": "(%)"},
            {"value": "2.7", "text": "检查收入占比", "unit": "(%)"}
        ]
    },
    {
        "label": "难度系数描述指标",
        "children": [
            {"value": "3.0", "text": "CMI", "unit": ""},
            {"value": "3.1", "text": "三四级手术占比", "unit": "(元)"}
        ]
    },
    {
        "label": "",
        "children": [
            {"value": "4", "text": "RW值区段", "unit": ""}
        ]
    }
];

//图表颜色配置
//var chartColor1 = "#5AB1EF";
var chartColor1 = "#0AA89E";
var chartColor2 = "#D87A80";
var chartColor3 = "#3DCACC";
var chartColor4 = "#C5B5E4";
var chartColor5 = "#C66";
var chartColor6 = "#FF7D5F";
var chartColorAdd = "#FFB980";
var chartColorCut = "#F00";

var fillColor = ["#D87A80","#2EC7C9","#B6A2DE","#5AB1EF","#FFB980","#AAB980"];

var chartGridOpt = {
    top: 40,
    left: '4%',
    right: '6%',
    bottom: '6%',
    containLabel: true
};

//小于10的数值前面增加0
function addZero(val){
    var value = (val < 10)? ("0"+val) : val;
    return value.toString();
}
//获取时间的 年、月、日
function getDate(time){
    var date;
    if(time){
        date = new Date(time);
    }else{
        date = new Date();
    }
    return {
        year : date.getFullYear(),
        month: addZero(date.getMonth()+1),
        day: addZero(date.getDate())
    };
}

//起始、结束时间 初始化
function startEndTimeInit($timeStart, $timeEnd, callback, defVal){
    var endDate = getDate();
    var startData = getDate((new Date()).getTime() - 30*24*60*60*1000);

    //起始时间datapicker参数设置
    var startTimeDPOpt = {
        language: 'zh-CN',
        startDate: '2010/1/1',
        endDate: endDate.year+"/"+endDate.month+"/"+endDate.day,
        autoclose: true,
        format: 'yyyy年mm月dd日'
    };
    //结束时间datapicker参数设置
    var endTimeDPOpt = {
        language: 'zh-CN',
        startDate: '2010/1/1',
        endDate: endDate.year+"/"+endDate.month+"/"+endDate.day,
        autoclose: true,
        format: 'yyyy年mm月dd日'
    };

    //设置时间默认初始值
    var defTime = {
        startTime: startData.year+"年"+startData.month+"月"+startData.day+"日",
        endTime: endDate.year+"年"+endDate.month+"月"+endDate.day+"日"
    };
    defTime = {
        startTime: "2010-01-01",
        endTime: "2015-12-31"
    };
    if(defVal){
        defTime.startTime = defVal.startTime;
        defTime.endTime = defVal.endTime;
    }
    $timeStart.val(defTime.startTime);
    $timeEnd.val(defTime.endTime);

    var startDPOpt = {}, endDPOpt = {};
    var startTime, endTime;
    startDPOpt = startTimeDPOpt;
    endDPOpt = endTimeDPOpt;

    var timeStartDP = $timeStart.datepicker(startDPOpt);
    var timeEndDP = $timeEnd.datepicker(endDPOpt);

    timeStartDP.on('changeDate',function(ev){
        startTime = ev.date.valueOf();

        var startTimeUTC = $timeStart.datepicker('getUTCDate');
        var endTimeUTC = $timeEnd.datepicker('getUTCDate');
        var curStartDate = getDate(startTimeUTC);
        var curEndDate = getDate(endTimeUTC);
        if(startTimeUTC > endTimeUTC){
            var newEndVal = curStartDate.year+"年"+curStartDate.month+"月"+curStartDate.day+"日";
            $timeEnd.val(newEndVal);
        }
        $timeEnd.datepicker('destroy');
        endDPOpt.startDate = curStartDate.year+"/"+curStartDate.month+"/"+curStartDate.day;
        timeEndDP = $timeEnd.datepicker(endDPOpt);
        $timeEnd.focus();
    });

    timeEndDP.on('changeDate',function(ev){
        endTime = ev.date.valueOf();
        var curDate = getDate(endTime);
        $timeEnd.datepicker('update', curDate.year+"-"+curDate.month+"-"+curDate.day);

        //提交
        if(callback){
            callback();
        }
    });

    //日历小图标点击触发日历窗口
    $(".fa-calendar").on('click', function(){
        $(this).siblings().filter('input').trigger('focus');
    });
}

//医院列表初始化
function hospListInit($elem, setting){
    //默认值(有"全部")
    var allTrueOpt = {
        hasAll: true,
        defId: ""  //全部
    };
    //默认值(没有"全部")
    var allFlaseOpt = {
        hasAll: false,
        defId: false
    };
    var defOpt = allTrueOpt; //默认使用(有"全部")

    var inData = {};
    if((typeof(setting) === "object")&&(typeof(setting.inPara) === "object")){
        inData = setting.inPara;
    }
    $elem.select2();
    $.ajax({
        type: "post",
        url: "common/hospital",
        dataType:"jsonp",
        data: inData,
        async: false,
        jsonp: "callback",
        success:function(data){
            var jsonData = eval(data);
            $elem.empty();
            var allBool = defOpt.hasAll;
            if((typeof(setting) === "object")&&(typeof(setting.hasAll) === "boolean")){
                allBool = setting.hasAll;
            }
            if(allBool){
                $elem.append("<option value=''>"+"全部"+"</option>");
            }
            $.each(jsonData, function(index, obj){
                $elem.append("<option value="+obj.id+">"+obj.name+"</option>");
            });
            //设置默认值
            if((typeof(setting) === "object")&&(typeof(setting.defId) != "undefined")){
                if(setting.defId != false){
                    $elem.val(setting.defId);
                }
            }else{
                if(typeof(defOpt.defId) != "undefined"){
                    if(defOpt.defId != false){
                        $elem.val(defOpt.defId);
                    }
                }
            }
            $elem.select2();
        },
        error:function(error){
            console.log(error);
        }
    });
}

//医院等级关联名称列表 初始化
function hospDegreeListInit($degree,$hosp,setting){
    //默认值(有"全部")
    var allTrueOpt = {
        degreeAll: true,
        hospAll: true,
        degreeId: "",
        hospId: ""
    };
    //默认值(没有"全部")
    var allFlaseOpt = {
        degreeAll: false,
        hospAll: false,
        degreeId: false,
        hospId: false
    };
    var defOpt = allTrueOpt; //默认使用(有"全部")

    //医院等级 加载
    $degree.empty();
    var degreeAll = defOpt.degreeAll;
    if((typeof(setting) === "object")&&(typeof(setting.degreeAll) === "boolean")){
        degreeAll = setting.degreeAll;
    }
    if(degreeAll){
        $degree.append("<option value=''>"+"全部"+"</option>");
    }
    $.each(hospitalDegree, function(index, obj) {
        $degree.append("<option value="+obj.value+">"+obj.name+"</option>");
    });
    //设置默认值
    if((typeof(setting) === "object")&&(typeof(setting.degreeId) != "undefined")){
        if(setting.degreeId != false){
            $degree.val(setting.degreeId);
        }
    }else{
        if(typeof(defOpt.degreeId) != "undefined"){
            if(defOpt.degreeId != false){
                $degree.val(defOpt.degreeId);
            }
        }
    }
    $degree.select2({minimumResultsForSearch: -1});

    //医院名称 加载
    if((typeof($hosp) != "undefined") && $hosp) {
        $degree.on('change', function(){
            $hosp.empty();
            var degreeVal = $degree.val(); //医院等级值
            if (degreeVal == "") {
                $hosp.append("<option value=''>" + "全部" + "</option>");
                $hosp.select2({minimumResultsForSearch: -1});
                $hosp.attr('disabled', 'disabled');
            }
            else{
                $hosp.removeAttr('disabled');
                //获取服务器数据
                var inData = {hospitalDegree:$degree.val()};
                $.ajax({
                    type: "post",
                    url: "common/hospital",
                    dataType:"jsonp",
                    data: inData,
                    async: false,
                    jsonp: "callback",
                    success:function(data){
                        var jsonData = eval(data);
                        $hosp.empty();
                        $hosp.hide();
                        var hospAll = defOpt.hospAll;
                        if((typeof(setting) === "object")&&(typeof(setting.hospAll) === "boolean")){
                            hospAll = setting.hospAll;
                        }
                        if(hospAll){
                            $hosp.append("<option value=''>"+"全部"+"</option>");
                        }
                        $.each(jsonData, function(index, obj){
                            $hosp.append("<option value="+obj.id+">"+obj.name+"</option>");
                        });
                        //设置默认值
                        if((typeof(setting) === "object")&&(typeof(setting.hospId) != "undefined")){
                            if(setting.hospId != false){
                                $hosp.val(setting.hospId);
                            }
                        }else{
                            if(typeof(defOpt.hospId) != "undefined"){
                                if(defOpt.hospId != false){
                                    $hosp.val(defOpt.hospId);
                                }
                            }
                        }
                        $hosp.show();
                        $hosp.select2();
                        $hosp.trigger('change');
                    },
                    error:function(error){
                        console.log(error);
                    }
                });
            }
        });
        $degree.trigger('change');
    }
}

//医生名称 初始化
function docListInit($elem, setting){
    //默认值(有"全部")
    var allTrueOpt = {
        hasAll: true,
        defId: ""  //全部
    };
    //默认值(没有"全部")
    var allFlaseOpt = {
        hasAll: false,
        defId: false
    };
    var defOpt = allFlaseOpt; //默认使用(有"全部")

    var inData = {};
    if((typeof(setting) === "object")&&(typeof(setting.inPara) === "object")){
        inData = setting.inPara;
    }
    $.ajax({
        type: "post",
        url: "orgDocAnalysis/getDocList",
        dataType:"json",
        data: inData,
        async: false,
        jsonp: "callback",
        success:function(data){
            var jsonData = eval(data);
            $elem.empty();
            $elem.hide();
            var allBool = defOpt.hasAll;
            if((typeof(setting) === "object")&&(typeof(setting.hasAll) === "boolean")){
                allBool = setting.hasAll;
            }
            if(allBool){
                $elem.append("<option value=''>"+"全部"+"</option>");
            }
            $.each(jsonData, function(index, obj){
                $elem.append("<option value="+obj.docId+">"+obj.docName+"</option>");
            });
            //设置默认值
            if((typeof(setting) === "object")&&(typeof(setting.defId) != "undefined")){
                if(setting.defId != false){
                    $elem.val(setting.defId);
                }
            }else{
                if(typeof(defOpt.defId) != "undefined"){
                    if(defOpt.defId != false){
                        $elem.val(defOpt.defId);
                    }
                }
            }
            $elem.show();
            $elem.select2();
        },
        error:function(error){
            console.log(error);
        }
    });
}

// MDC、DRG列表初始化
function mdcDrgListInit($mdc, $drg, setting){
    //默认值(MDC有"全部")
    var mdcAllTrueOpt = {
        mdcAll: true,
        mdcId: "",  //全部
        drgId: ""   //全部
    };
    //默认值(MDC没有"全部")
    var mdcAllFlaseOpt = {
        mdcAll: false,
        mdcId: false,
        drgId: false
    };
    var defOpt = mdcAllTrueOpt; //默认使用(MDC有"全部")

    var inData = {};
    if((typeof(setting) === "object")&&(typeof(setting.inPara) === "object")){
        inData = setting.inPara;
    }
    // 获取MDC列表
    $mdc.select2();
    $.ajax({
        type: "post",
        url: "common/mdcDrgList",
        dataType:"jsonp",
        data: inData,
        async: false,
        jsonp: "callback",
        success:function(data){
            var jsonData = eval(data);
            //MDC
            $mdc.empty();

            var mdcAllBool = defOpt.mdcAll;
            if((typeof(setting) === "object")&&(typeof(setting.mdcAll) === "boolean")){
                mdcAllBool = setting.mdcAll;
            }
            if(mdcAllBool){
                $mdc.append("<option value=''>"+"全部"+"</option>");
            }
            $.each(jsonData, function(index, obj){
                $mdc.append("<option value="+obj.code+">"+obj.name+"</option>");
            });
            //设置MDC默认值
            if((typeof(setting) === "object")&&(typeof(setting.mdcId) != "undefined")){
                if(setting.mdcId != false){
                    $mdc.val(setting.mdcId);
                }
            }else{
                if(!mdcAllBool){
                    defOpt = mdcAllFlaseOpt;
                }
                if(typeof(defOpt.mdcId) != "undefined"){
                    if(defOpt.mdcId != false){
                        $mdc.val(defOpt.mdcId);
                    }
                }
            }
            $mdc.select2();

            //DRG
            if((typeof($drg) != "undefined") && $drg){
                $mdc.on('change',function(){
                    var drgAll = true; // DRG默认有全部选项
                    $drg.empty();
                    var curVal = $(this).val();//变化的当前值
                    if(curVal == ""){
                        $drg.append("<option value=''>"+"全部"+"</option>");
                        $drg.attr('disabled','disabled');
                    }
                    else{
                        $drg.removeAttr('disabled');
                        if((typeof(setting) === "object")&&(typeof(setting.drgAll) === "boolean")){
                            drgAll = setting.drgAll;
                        }
                        if(drgAll){
                            $drg.append("<option value=''>"+"全部"+"</option>");
                        }
                        $.each(jsonData, function(index, obj){
                            if(jsonData[index].code == curVal){//如果这个级还有child
                                var childData = jsonData[index].children;
                                $.each(childData, function(index, obj){//二级遍历
                                    $drg.append("<option value="+obj.code+">"+obj.name+"</option>");
                                });
                            }
                        });
                    }

                    //设置DRG默认值
                    if((typeof(setting) === "object")&&(typeof(setting.drgId) != "undefined")){
                        if(setting.drgId != false){
                            $drg.val(setting.drgId);
                        }
                    }else{
                        if(typeof(defOpt.drgId) != "undefined"){
                            if(defOpt.drgId != false){
                                $drg.val(defOpt.drgId);
                            }
                        }
                    }
                    $drg.select2();
                    $drg.trigger('change');
                });
                $mdc.trigger('change');
            }
        },
        error:function(error){
            console.log(error);
        }
    });
}

//角色列表初始化
function roleInit($role, setting){
    //默认值(有"全部")
    var roleAllTrueOpt = {
        roleAll: true,
        roleId: ""   //全部
    };
    //默认值(没有"全部")
    var roleAllFlaseOpt = {
        roleAll: false,
        roleId: false  //默认选取第一个
    };
    var defOpt = roleAllTrueOpt; //默认使用(有"全部")

    var $elem = $role;
    //获取列表
    $elem.select2({minimumResultsForSearch: -1});
    $.ajax({
        type: "post",
        url: "manageRole/roleAll",
        dataType:"json",
        data: '',
        async: false,
        jsonp: "callback",
        success:function(data){
            var jsonData = eval(data);
            var roleData = jsonData["roles"];
            //角色
            $elem.empty();
            var roleAllBool = defOpt.roleAll;
            if((typeof(setting) === "object")&&(typeof(setting.roleAll) === "boolean")){
                roleAllBool = setting.roleAll;
            }
            if(roleAllBool){
                $elem.append("<option value="+""+">"+"全部"+"</option>");
            }
            $.each(roleData, function(index, obj){
                $elem.append("<option value="+obj.id+">"+obj.name+"</option>");
            });
            //设置默认值
            if((typeof(setting) === "object")&&(typeof(setting.roleId) != "undefined")){
                if(setting.roleId != false){
                    $elem.val(setting.roleId);
                }
            }else{
                if(!roleAllBool){
                    defOpt = roleAllFlaseOpt;
                }
                if((typeof(defOpt.roleId) != "undefined")&&(defOpt.roleId != false)) {
                    $elem.val(defOpt.roleId);
                }
            }
            $elem.select2({minimumResultsForSearch: -1});
        },
        error:function(error){
            console.log(error);
        }
    });
}

//格式化数据函数
function fatVal(){
    this.toFloatVal = function(val){
        return Number(parseFloat(val, 10).toFixed(2));
    };
    //获取百分数数值
    this.getPerVal = function(val){
        var value = val.split("%")[0];
        return this.toFloatVal(value);
    };
    //获取数值
    this.getNum = function(val, digit){
        var resVal;
        if(Number == (typeof digit)){
            resVal = Number(parseFloat(val, 10).toFixed(parseInt(digit,10)));
        }
        else{
            resVal = Number(parseFloat(val, 10));
        }
        return resVal;
    };
}

//数组计算
function calValFun(){
    //转换成保留2位的浮点数
    this.toFloatVal = function(val){
        return Number(parseFloat(val, 10).toFixed(2));
    };
    //取得数组最值
    this.arrMost = function(valArr){
        var maxVal = 0, minVal = 0;
        var arrLength = valArr.length;
        maxVal = this.toFloatVal(valArr[0]);
        minVal = this.toFloatVal(valArr[0]);
        for(var i=0; i<arrLength; i++){
            var curVal = this.toFloatVal(valArr[i]);
            minVal = (minVal > curVal) ? curVal : minVal;
            maxVal = (maxVal < curVal) ? curVal : maxVal;
        }
        return {
            min: minVal,
            max: maxVal
        };
    };
    //获取十整数倍的区间上、下限值
    // flag：true --> 上限值 ， flag：false --> 下限值
    this.tensReg = function(val, flag){
        var tensNum = 0;
        var tensDig = 0;
        var unitDig = 0;
        var curVal = Number(parseFloat(val, 10).toFixed(2));
        tensDig = parseInt(curVal / 10, 10);
        unitDig = parseInt(curVal % 10, 10);
        if(unitDig >= 9){
            tensDig = flag ? (tensDig + 2) : tensDig;
        }
        else if((unitDig > 2)&&unitDig < 9){
            tensDig = flag ? (tensDig + 1) : tensDig;
        }
        else{
            tensDig = flag ? (tensDig + 1) : (tensDig - 1);
        }
        tensNum = tensDig * 10;
        return tensNum;
    };
}

// Echats图表函数自定义
var barValFun = new calValFun();
// 柱状图
function setBarChart(echarts, options, jsonData, direction){
    if(jsonData["axis"].length == 0){
        echarts.showLoading({
            text:"无数据，请修改查询条件重试！",
            textStyle : {
                fontSize : 20
            },
            effect : 'bubble'
        });
        return false;
    }
    //数据整理
    var axisArr = jsonData["axis"];
    var dataArr = jsonData["series"];
    var rankArr = jsonData["ranking"];

    if(direction == "vertical"){
        options.xAxis[0].type = 'value';
        options.xAxis[0].position = 'left';

        options.yAxis[0].type = 'category';
        options.yAxis[0].position = 'bottom';

        options.yAxis[0].data = axisArr;
    }
    else{
        options.xAxis[0].type = 'category';
        options.xAxis[0].position = 'bottom';

        options.yAxis[0].type = 'value';
        options.yAxis[0].position = 'left';

        options.xAxis[0].data = axisArr;
    }

    for(var i=0;i<jsonData["series"].length; i++){
        options.series[i].data = dataArr[i];
    }

    options.series[0].ranking = rankArr;

    var distMin, distMax;
    var minMax  = barValFun.arrMost(dataArr[0]);
    var diffMinMax = Math.abs(minMax.max - minMax.min);
    if(diffMinMax < 10){
        var partOfDiff = barValFun.toFloatVal(diffMinMax / 10);
        distMax = barValFun.toFloatVal(minMax.max + partOfDiff);
        distMin = barValFun.toFloatVal(minMax.min - partOfDiff);
    }
    else{
        distMin = barValFun.tensReg(minMax.min, false);
        distMax = barValFun.tensReg(minMax.max, true);
    }

    //distMax = (distMax > 100) ? 100 : distMax;
    distMin = (distMin < 0) ? 0 : distMin;

    if(direction == "vertical"){
        //数值坐标的区间
        options.xAxis[0].min = distMin;
        options.xAxis[0].max = distMax;
    }
    else{
        //数值坐标的区间
        options.yAxis[0].min = distMin;
        options.yAxis[0].max = distMax;
    }

    //自定义提示框
    options.tooltip.trigger = 'axis';
    options.tooltip.showDelay = 200;
    options.tooltip.hideDelay = 50;
    options.tooltip.transitionDuration = 0;
    options.tooltip.borderRadius = 8;
    options.tooltip.padding = 10;
    options.tooltip.formatter = function (params,ticket,callback) {
        var optionObj  = echarts.getOption();
        var res = '';
        for (var i = 0, l = params.length; i < l; i++) {
            var objIndex = params[i].dataIndex;
            res += "<div class='bartip-hd'>"+params[i].name+"</div>";
            res += params[i].seriesName + ' : ' + parseFloat(params[i].value).toLocaleString();
            res += '<br/>' + "排名" + ' : ' + optionObj.series[0].ranking[objIndex];
        }
        return res;
    };

    echarts.hideLoading();
    echarts.setOption(options);
    options.version++;
}

// 堆叠柱状图
function setBarStackChart(echarts, options, jsonData, direction){
    if(jsonData["axis"].length == 0){
        echarts.showLoading({
            text:"无数据，请修改查询条件重试！",
            textStyle : {
                fontSize : 20
            },
            effect : 'bubble'
        });
        return false;
    }
    //数据整理
    var axisArr = jsonData["axis"];
    var dataArr = jsonData["series"];

    if(direction == "vertical"){
        options.xAxis.type = 'value';
        options.xAxis.position = 'left';

        options.yAxis.type = 'category';
        options.yAxis.position = 'bottom';

        options.yAxis.data = axisArr;
    }
    else{
        options.xAxis.type = 'category';
        options.xAxis.position = 'bottom';

        options.yAxis.type = 'value';
        options.yAxis.position = 'left';

        options.xAxis.data = axisArr;
    }

    var dataArrSize = dataArr.length;
    for(var i=0;i<dataArrSize; i++){
        options.series[i].data = dataArr[i];
    }

    //自定义提示框
    options.tooltip.trigger = 'axis';
    options.tooltip.showDelay = 200;
    options.tooltip.hideDelay = 50;
    options.tooltip.transitionDuration = 0;
    options.tooltip.borderRadius = 8;
    options.tooltip.padding = 10;

    echarts.hideLoading();
    echarts.clear();
    echarts.setOption(options);
    options.version++;
}

// 仪表盘
function setGaugeChart(echarts, options, jsonData){
    var seriesLength = jsonData["series"].length;

    if(seriesLength == 0){
        echarts.showLoading({
            text:"无数据，请修改查询条件重试！",
            textStyle : {
                fontSize : 20
            },
            effect : 'bubble'
        });
        return false;
    }

    for(var i=0; i<seriesLength; i++){
        options.series[i].data[0].value = jsonData["series"][i];
    }

    echarts.hideLoading();
    echarts.setOption(options);
    options.version++;
}

// 饼状环形图
function setPieCirChart(echarts, options, jsonData){
    var seriesLength = jsonData["series"].length;
    if(seriesLength == 0){
        echarts.showLoading({
            text: "无数据，请修改查询条件重试！",
            textStyle: {
                fontSize : 20
            },
            effect: 'bubble'
        });
        return false;
    }

    var curVal = jsonData["series"][0];
    options.series[0].data[0].value = 100 - curVal;
    options.series[0].data[1].value = curVal;

    echarts.hideLoading();
    echarts.setOption(options);
    options.version++;
}


// 饼图
function setPieChart(echarts, options, jsonData){
    var legendData = jsonData["axis"];
    var seriesData = jsonData["series"];

    if(legendData.length == 0){
        echarts.showLoading({
            text:"无数据，请修改查询条件重试！",
            textStyle : {
                fontSize : 20
            },
            effect : 'bubble'
        });
        return false;
    }
    var pieColor = ["#D87A80","#2EC7C9","#B6A2DE","#5AB1EF","#FFB980","#AAB980","#8D98B3","#E5CF0D","#95706D","#DC69AA"];
    var legendArr = [];
    var seriesArr = [];
    for(var i=0, arrLeng=seriesData[0].length; i<arrLeng; i++){
        var curAxis = (legendData[i]).toString();
        seriesArr[i] = {name: curAxis,value:seriesData[0][i],itemStyle:{normal:{color:pieColor[i]}}};
        legendArr[i] = curAxis;
    }

    options.legend.data = legendArr;
    options.series[0].data = seriesArr;

    //自定义提示框
    options.tooltip.trigger= 'item';
    options.tooltip.showDelay= 0;
    options.tooltip.hideDelay= 50;
    options.tooltip.transitionDuration=0;
    options.tooltip.borderRadius = 8;//提示边框圆角
    options.tooltip.padding = 10;

    echarts.hideLoading();
    echarts.setOption(options);
    options.version++;
}

// 折线图
function setLineChart(echarts, options, jsonData){
    var axisLength = jsonData["axis"][0].length;
    var seriesData = jsonData["series"];
    if(axisLength == 0){
        echarts.showLoading({
            text:"无数据，请修改查询条件重试！",
            textStyle : {
                fontSize : 20
            },
            effect : 'bubble'
        });
        return false;
    }

    options.xAxis.data = jsonData["axis"][0];

    for(var i=0; i<seriesData.length; i++){
        options.series[i].data = seriesData[i];
    }

    //自定义提示框
    options.tooltip.trigger = 'axis';
    options.tooltip.showDelay = 0;
    options.tooltip.hideDelay = 50;
    options.tooltip.transitionDuration = 0;
    options.tooltip.borderRadius = 8;//提示边框圆角
    options.tooltip.padding = 10;

    echarts.hideLoading();
    echarts.setOption(options);
    options.version++;
}

// 折线差值图
function setLineDiffChart(echarts, options, jsonData){
    var axisLength = jsonData["axis"].length;
    if(axisLength == 0){
        echarts.showLoading({
            text:"无数据，请修改查询条件重试！",
            textStyle : {
                fontSize : 20
            },
            effect : 'bubble'
        });
        return false;
    }
    var handleVal = new fatVal();

    options.xAxis.data = jsonData["axis"];
    options.series[0].data = jsonData["series"][0];
    options.series[1].data = jsonData["series"][1];
    //options.series[2].data = jsonData["series"][2];
    //options.series[3].data = jsonData["series"][3];

    //自定义提示框
    options.tooltip.trigger= 'axis';
    options.tooltip.showDelay= 0;
    options.tooltip.hideDelay= 50;
    options.tooltip.transitionDuration=0;
    options.tooltip.borderRadius = 8;//提示边框圆角
    options.tooltip.padding = 10;
    options.tooltip.backgroundColor = 'rgba(30,30,30,0.7)';
    options.tooltip.formatter = function (params){
        var isRiseIcon = "";
        var curDiff = params[0].value - params[1].value;
        isRiseIcon = (curDiff >= 0) ? "<em class='rise-icon'></em>&nbsp;" : "<em class='lower-icon'></em>&nbsp;";
        return params[0].name + ' : ' + isRiseIcon + Math.abs(handleVal.toFloatVal(curDiff)) + '<br/>'
            + params[0].seriesName + ' : ' + params[0].value + '<br/>'
            + params[1].seriesName + ' : ' + params[1].value + '<br/>'
    };

    echarts.hideLoading();
    echarts.clear();
    echarts.setOption(options);
    options.version++;
}
